{"format_version":1,"entries":[{"id":"minicraftplus_2.2.0-pre2","title":"Minicraft Plus 2.2.0 Pre-Release 2","body":"<h2>Additions</h2><ul><li>Added a standard PopupDisplay for all popups</li><li>Added a crash handler and a better look of dialog.</li><li>Added a simple ability for screenshots</li><li>Added dynamic for sounds</li><li>Added sand particle for sand</li><li>Added more support fonts</li><li>Added world-wide seed</li></ul><h2>Changes</h2><ul><li>Split the images of textures</li><li>Changed the UI of crash popup</li><li>Changed a better logging</li><li>Improved the localization support</li><ul><li>Updated the localization for displays and for parameterized localizations</li><li>Changed some localization keys into IDs instead of words themselves</li></ul><li>With optional flag `--savedir`, if present, no longer is appended an extra '.playminicraft/mods/Minecraft Plus' to it</li><li>Improved some textures</li><li>Restructured the resources</li><li>Enhanced the rendering system for sprites</li><ul><li>Added standard LinkedSprite, SpriteAnimation (also replaces the role of ConnectorSprite) for all sprite renderings</li><li>Removed ConnectorSprite for tiles, MobSprite for mobs (with more standard way)</li><li>Renamed SpriteSheet into MinicraftImage</li></ul><li>Slightly standardized all the resource handlers</li><ul><li>For localizations, sounds, textures, books</li><li>Does not rule out the possibility of addition of a standard resource manager</li></ul><li>Reapplied the role of seeds (the sameness with same seed)</li><li>Now renders the parent display as background.</li></ul><h2>Removals</h2><ul><li>Removed stepped sand texture</li></ul>"},{"id":"minicraftplus_2.2.0-pre1","title":"Minicraft Plus 2.2.0 Pre-Release 1","body":"<h2>Additions</h2><ul><li>Quests and tutorial</li><li>Obsidian knight as the second boss</li><li>Limitation to inventories</li><li>Limitation to stackable items</li><li>4 new debug arguments</li><li>A toggle for HUD display</li><li>A toggle for simplified effect display</li><li>A new menu for creative mode</li><li>A few creative mode only items for tile placement</li></ul><h2>Changes</h2><ul><li>Improved the localization support</li><li>Changed the display of world edit</li><ul><li>Removed another display for world edits</li></ul><li>Greatly improved the resource pack system</li><li><ul><li>The past versions of resource packs are unsupported</li><li>Changed the structure of resource pack</li><li>Improved the handling of skins</li></ul></li></ul><h2>Bug Fixes</h2><ul><li>Fixed seed random problem</li></ul>"},{"id":"minicraftplus_2.1.3","title":"Minicraft Plus 2.1.3","body":"<h2>Removals</h2><ul><li>Removed option of changing skin in the options display because of a crash</li></ul><h2>Bug Fixes</h2><ul><li>Fixed localization not being loaded on first launch</li></ul>"},{"id":"minicraftplus_2.1.2","title":"Minicraft Plus 2.1.2","body":"<h2>Bug Fixes</h2><ul><li>Fixes a bug where some worlds would not load, because it attempts to check if the player is suited, even though suits were removed.</li></ul>"},{"id":"minicraftplus_2.1.1","title":"Minicraft Plus 2.1.1","body":"<p>This version fixes some game breaking errors. Fixes like spawning outside the map and non-functioning air wizard spawners</p>"},{"id":"minicraftplus_2.1.0","title":"Minicraft Plus 2.1.0","body":"<p>This is the release of version 2.1.0. It has been in development for over five months, and has now been released.</p><p>This version adds new features such as a achievement system, decorative tiles, totems, and a resource pack system. Furthermore, this version adds a lot of minor features, and an even larger amount of bugfixes and QoL additions. Changes to the skin system have been made, to make it more stable, and changing the style of the menus for resource packs, skins, and achievements.</p><p>This release also introduces some new recurring contributors: @lino-levan and @BenCheung0422; and we see the return of @Litorom and @TheBigEye. In addition to this, we see some fixes by @alice39, @PseudoDistant, @Sissiogamer1, and @rockedsocks.</p><h2>Additions</h2><ul><li>Added achievements</li><li>Added ability to copy, cut, and paste in menus</li><li>Added credits menu</li><li>Added the ability to use some ascii characters in world seed</li><li>Added ornate obsidian and ornate stone tiles</li><li>Added raw obsidian and stone tiles</li><li>Added a totem that will spawn the air wizard</li><li>Added resource packs</li><li>Added sound when harvesting plants</li><li>Re-added sparks</li><li>Re-added damage particles</li><li>Re-added item shadows</li><li>Re-added swimming animation</li><li>Re-added colored spawners</li></ul><h2>Changes</h2><ul><li>Made gem tools purple</li><li>Prevented animals and mobs from de-spawning while in view</li><li>Prevented furniture from being pushed over stair tiles</li><li>Shear loses durability when used on sheep</li><li>The world list should now update if copying or renaming worlds in-game</li><li>Resource packs and skins menu now use the standardised menu look</li><li>Pre-releases are now ignored from version check</li><li>Renamed shear to shears</li><li>Saplings should no longer grow if an entity is on it</li><li>Made cloud cactus into an ore you can mine and use</li></ul><h2>Removed</h2><ul><li>Removed texture packs</li><li>Removed suits</li><li>Removed second air wizard</li></ul><h2>Bug Fixes</h2><ul><li>Fixed crash when inputting certain characters into the inventory searcher</li><li>Fixed crash when deleting world</li><li>Fixed rendering of stair tiles in sky level</li><li>Fixed rendering of cloud cactus in sky level</li><li>Fixed time rendering for potions not following m:ss format</li><li>Fixed some hits not hitting properly (0 attack damage)</li></ul>"},{"id":"minicraftplus_2.0.7","title":"Minicraft Plus 2.0.7","body":"<h2>Added</h2><ul><li>Added sheep shearing</li><li>Added shear tool</li><li>Added potatoes</li><li>Added baked potatoes as food</li><li>Added inventory searcher (F to toggle and Next/Back Page to seek)</li><li>Added fullscreen mode (default key F11)</li><li>Added Indonesian localization</li><li>Added Hungarian localization</li><li>Added SRV record support; service name is _minicraft (only accessible through code)</li><li>Added aggregate analytics for various game states and actions</li><li>Added new skin system with custom skin support</li><li>Added built-in contest winners' skins into skins menu</li></ul><h2>Changed</h2><ul><li>Made zombies drop potatoes</li><li>Sparks (the airwizard bullets) have been optimized</li><li></li><li>Made crops grow slower</li><li>Updated some textures; made wood, apples and gold apples look better</li><li>Made sheep drop beef</li><li>Picking up furniture no longer requires stamina</li><li>You can only use axes on walls, wood doors and wood floor</li><li>Shears must be used to destroy wool tiles</li><li>Disabled multiplayer functionality</li></ul><h2>Fixed</h2><ul><li>Fixed pickup dungeon chests</li><li>Farm tiles will no longer be destroyed if an item is dropped onto it</li><li>Mobs no longer target and attack you when you are in creative mode</li><li>Fixed sound not playing on certain actions</li></ul>"},{"id":"minicraftplus_2.0.6","title":"Minicraft Plus 2.0.6","body":"<h2>Added</h2><ul><li>Added French localization</li><li>Added more buildings, including abandoned villages</li><li>Added paths, use a pickaxe on grass to make them</li></ul><h2>Changed</h2><ul><li>Prevented players from getting stuck in skyholes with cool animation</li><li>Made the quick-save key configurable</li><li>Let you place floors on clouds</li><li>Water and lava now form obsidian, and don't look like sand when they are next to each other</li><li>Totally overhauled fishing!</li><li>You can now craft obsidian walls and doors</li><li>Resource packs are now possible! Guide is on the wiki</li><li>Creepers have been buffed</li><li>TNT can't break hard rock or obsidian walls</li><li>Menus that don't have frames don't render the title background</li></ul><h2>Fixed</h2><ul><li>Fixed the creeper explosion to only hurt mobs if it actually explodes</li><li>Fixed small line in the snake sprite that shouldn't be there</li><li>Knights and snakes only have 4 levels instead of 5</li><li>Villages and spawner can no logger override stair barriers (to the sky or the dungeon)</li></ul>"},{"id":"minicraftplus_2.0.5","title":"Minicraft Plus 2.0.5","body":"<h2>Added</h2><ul><li>Added tool durability to all tools</li><li>Added window popup to display errors</li><li>Added Spanish localization</li><li>Added escape potion, which brings you one level closer to the surface from where it's used</li><li>Added an indicator to tell you what tile in item will be placed on</li></ul><h2>Changed</h2><ul><li>Updated door sprites and a couple others in minor ways</li><li>Allowed creative player to walk outside cloud tiles in the sky</li><li>Made hoe turn grass into dirt instead of straight to farmland; but with significantly higher chance of seeds</li><li>Made some adjustments to some of the sprites for improved detail</li><li>Made flowers spread grass to dirt like grass spreads to dirt, since a flower tile is technically grass too</li><li>Separated directional input into movement and cursor, for player movement and menu selection respectively</li><li>Made sand behave like dirt when being placed</li><li>Made items face the right way when you attack with them</li></ul><h2>Fixed</h2><ul><li>Fixed a couple more multiplayer bugs; also, as of dev6, players should stop crashing when changing levels</li><li>Fixed some localization bugs</li><li>Fixed bug with item crafting and reference</li><li>Fixed bug with dungeon chests refilling on load</li><li>Fixed bug with \\&quot;Click to focus\\&quot; text rendering</li><li>Fixed bug with armor loading</li><li>Fixed the wheat tile background</li><li>Fixed bug where creative player couldn't break a tile</li><li>Fixed item data in chests</li></ul>"},{"id":"minicraftplus_2.0.4","title":"Minicraft Plus 2.0.4","body":"<h2>Added</h2><ul><li>Added world seeding! You now have a reliable way of recreating a world... provided you used a seed in the first place, that is... Commands aren't quit here yet...</li><li>Added a splash screen! So it's pretty while it's loading.</li><li>Added an official logo! Curtesy of contributors on our discord server.</li><li>Added a new sprite for the log, so it will stop getting confused with planks.</li><li>Added/fixed the hints that pop up when you try to place walls/floors/doors.</li><li>Added an in-game, in-depth storyline guide.</li><li>Added an FPS slider.</li><li>Added keys being dropped back into the game... because apparently that feature disappeared somewhere.</li><li>Added player hunger to world save.</li><li>Added a version checker, so you know when new updates are available without having to look. It even opens the link for you. ;)</li></ul><h2>Changed</h2><ul><li>HUGE menu renovation! Menus will be changed forever. You'll see. It's pretty obvious</li><li>Made default game mode Normal instead of Easy.</li><li>Redid and fixed death chests; they now display time left above the chest, and you \\&quot;pickup\\&quot; everything in the chest by touching it. It also flashes red when there are 20 seconds before disappearing.</li><li>Changed beds in multiplayer, so that all players must be sleeping before the game speeds up.</li></ul><h2>Removed</h2><ul><li>Removed the \\&quot;home\\&quot; functionality.</li></ul><h2>Fixed</h2><ul><li>Fixed multiplayer bug where you could only deal 1 damage to things</li><li>Fixed a long-standing bug that mainly affected dungeon chests and airwizards not appearing when they should, as well as mob spawner dungeons</li><li>Fixed score mode in multiplayer</li></ul>"},{"id":"minicraftplus_2.0.3","title":"Minicraft Plus 2.0.3","body":"<h2>Added</h2><ul><li>Added support for dedicated servers! With a CLI OS, meaning an OS without a GUI. This allows for more compatibility, not to mention more resources being able to be devoted to the game.</li><li>Added various server options, and a command help system, for dedicated servers.</li><li>Added feature to save the last ip address you entered when trying to join a multiplayer server</li><li>Added more error messages when connecting</li><li>Added the ability to drop an item to the ground with Q and shift-Q (shift-q drops the whole stack)</li><li>Created an account system! you must now register on the playminicraft site to use multiplayer. Comes with offline mode.</li><li>Added an fps limiter</li><li>Added back and fixed knockbacks, after removing them since they didn't work how I wanted.</li></ul><h2>Changed</h2><ul><li>Made it so you can transfer single items to and from chests, with the drop key.</li><li>Made various optimizations to the code</li><li>Allowed torches to be placed on obsidian bricks</li></ul><h2>Fixed</h2><ul><li>Fixed item entity spawn positions and going through other tiles</li><li>Fixed bugs with creative inventory, so it always has all items.</li><li>Fixed issues with the pickup control in single player and multiplayer</li><li>Fixed multiplayer client saving with the account system.</li></ul>"},{"id":"minicraftplus_2.0.3-pre6","title":"Minicraft Plus 2.0.3 Pre-Release 6","body":"<h2>Bug Fixes</h2><ul><li>Fixed some level generation bugs, and tile updates on servers.</li></ul>"},{"id":"minicraftplus_2.0.3-pre5","title":"Minicraft Plus 2.0.3 Pre-Release 5","body":"<h2>Bug Fixes</h2><ul><li>Fixed some inventory and item drop bugs.</li></ul>"},{"id":"minicraftplus_2.0.3-pre4","title":"Minicraft Plus 2.0.3 Pre-Release 4","body":"<h2>Additions</h2><ul><li>Added accounts</li></ul>"},{"id":"minicraftplus_2.0.3-pre2","title":"Minicraft Plus 2.0.3 Pre-Release 2","body":"<h2>Additions</h2><ul><li>Added item dropping.</li></ul>"},{"id":"minicraftplus_2.0.3-pre1","title":"Minicraft Plus 2.0.3 Pre-Release 1","body":"<h2>Additions</h2><ul><li>Support for dedicated servers without a GUI.</li></ul>"},{"id":"minicraftplus_2.0.2","title":"Minicraft Plus 2.0.2","body":"<h2>Added</h2><ul><li>Added &quot;unknown&quot; item to make it obvious when something has gone wrong; it has the requested name, but the sprite is a pink square.</li><li>Added F3 menu for the server instance of the game in multiplayer.</li></ul><h2>Changed</h2><ul><li>Switched the multiplayer protocol from UDP to TCP.</li><li>Made TNT light other TNT</li><li>Edited coal drop amount</li><li>Made lots of edits to mob spawn rate, and mob count management</li><li>Made it so all mobs (not players obviously) despawn after a certain amount of time (will later be fixed so mobs close to the player don't despawn.</li><li>Made enchanter craftable.</li></ul><h2>Fixed</h2><ul><li>Fixed problems with doors, floors, and walls (item drops, etc.)</li><li>Fixed multiplayer attack rendering across clients; now shows attack, including the item a client is attacking with.</li><li>Fixed creative inventory for clients in multiplayer.</li><li>Fixed multiplayer client saving.</li><li>Fixed unlocked score mode times not appearing until you restarted the game; you shouldn't have to restart it now.</li><li>Patched possible duplicate usernames glitch</li></ul><h2>Removed</h2><ul><li>Removed enchanter and workbench from starting inventory.</li><li>Removed the power glove. It's still used, but you can only use it by pressing the &quot;pickup&quot; key (&quot;v&quot; by default); you can't get it in your inventory.</li><li>Removed all the &quot;frozen mobs&quot; which kept appearing in multiplayer</li></ul>"},{"id":"minicraftplus_2.0.1","title":"Minicraft Plus 2.0.1","body":"<h2>Added</h2><ul><li>Added more super-secret debug powers... mua ha ha...</li><li>Added to F3 window: level mobcount + max mobcount, and name of current tile</li><li>Added multiplayer feature: when hosting a server, a new window opens up for you to play as any other player, though your settings will be saved so that your should be able to continue as normal if you load the world as single player again. The server window lets you view the players connected, and change world difficulty and such.</li><li>Added multiplayer feature: the inventory and such data for people connected to the server is saved in a seperate file along with the computer's MAC address, so if they connect with that computer again, their inventory and stats should be restored.</li></ul><h2>Changed</h2><ul><li>This version should be compatible with 1.8 save files.</li><li>Edited the mob spawning algorithm, so mobs should not spawn at such a crazy speed as before</li><li>Renovated Multiplayer! It should now be much less laggy. Still not quite tolerable, but... better.</li><li>Ensured that most all the normal world features work in multiplayer. However, I have not been able to do much testing with Client Player saves, so that might not work very well. Everything else should work, though; but the connection lag between computers may cause some wierd effects. Fixing this lag is my next goal.</li></ul><h2>Fixed</h2><ul><li>Arrows now appear in your inventory</li><li>Fixed crafting; correct number of items are used</li><li>Creepers shouldn't be able to blow up stairs anymore</li><li>Bed spawning should now work; once you sleep in a bed, you will always spawn from the place that you were standing right before you got in bed, unless that spot later becomes rock, or something else a player can't walk through. The bed does not have to remain where it is; you can destroy it, and you will continue to spawn in the spot described above.</li><li>Fixed Save folder for non-windows users. You may notice a strange folder called &quot;null&quot; in the same folder as the minicraft jar. Move the &quot;.playminicraft&quot; folder inside to your home directory, and it should recognize it again. It may be hidden due to the &quot;.&quot;</li></ul>"},{"id":"minicraftplus_2.0.1-pre6","title":"Minicraft Plus 2.0.1 Pre-Release 6","body":"<p>Fixed wait time again and edited debug statements</p>"},{"id":"minicraftplus_2.0.1-pre5","title":"Minicraft Plus 2.0.1 Pre-Release 5","body":"<p>Tried to add player addition when not moving</p>"},{"id":"minicraftplus_2.0.0","title":"Minicraft Plus 2.0.0","body":"<h2>Added</h2><ul><li>MULTIPLAYER MODE now supported! (dun, dun-dun-dun!)</li><ul><li>Well... kind of. I got one way to work, but it's super laggy.</li></ul></ul><h2>Fixed</h2><ul><li>You disappear from the level when you get in bed, as you should</li><li>You can now see the edges of the level</li><li>Crafting furniture no longer disappears upon loading a pre-existing world</li><li>Stackable item count decreases as it should</li></ul>"},{"id":"minicraftplus_2.0.0-pre1","title":"Minicraft Plus 2.0.0 Pre-Release 1","body":"<h2>Bug Fixes</h2><ul><li>Fixed bottom and right level edges becoming grass</li></ul>"},{"id":"minicraftplus_2.0.0-pre2","title":"Minicraft Plus 2.0.0 Pre-Release 2","body":"<p>The first semi-stable version of multiplayer. I sent pixels across. It was super laggy...</p>"},{"id":"minicraftplus_2.0.0-pre1","title":"Minicraft Plus 2.0.0 Pre-Release 1","body":"<p>The first release with something resembling multiplayer!</p>"},{"id":"minicraftplus_1.9.4","title":"Minicraft Plus 1.9.4","body":"<h2>Added</h2><ul><li>Daylight now increases and decreases more smoothly; steadily goes from dark to light in the morning, and light to dark in the evening.</li><li>Added Instant Health Potion! Instantly refills up to 5 hearts.</li><li>Added missingTexture sprite.</li><li>Added some more help messages when trying do things that you might not know you can't do yet. (destroying hardrock, obsidian stair on lava level).</li><li>Added small tweak for creative mode: empty buckets will remain empty, so you can empty the ocean as much as you like. Full buckets remain full, as well.</li><li>You can now copy world saves.</li><li>Added another confirm dialog before deleting worlds.</li><li>Player score shown on-screen in score mode. TIP: as you probably don't know... you can unlock new time limits for score mode. unlock 10min by getting 1000 points in a 20min game, and unlock 2Hour by getting 100,000 points in a 1Hour game. (Hint: defeating the AirWizard gives you 100,000 points...)</li></ul><h2>Changes</h2><ul><li>Almost total revision of lighting; surface level now has lighting overlay sometimes, and the colors all around may be slightly different.</li><li>Changed death chest expire times; easy: 30min, norm: 10min, hard: 2min</li><li>Speed up sleeping game speed.</li><li>Prevented Airwizard from being removed during daily entity clear.</li><li>Increased Torch light radius; also, torches now work the same way on the surface as they do in the caves.</li><li>Changed the name of a couple items (was abbreviated).</li><li>Wool slows down all mobs except you.</li><li>Imposed a limit to the number of mobs that can spawn on a level, dependent on the level and the game difficulty.</li><li>Additional creative mode tweak: &quot;attacking&quot; mob spawner with hand changes the level of mob it spawns. Also, you can pick up spawners in creative mode.</li><li>Creative mode inventory remains full.</li><li>Key controls displayed on (hopefully) all menus will always be correct. ;)</li><li>Revised some key binding details to hopefully prevent inability to select anything. Also, added feature to reset all key bindings to default.</li></ul>"},{"id":"minicraftplus_1.9.4-pre6","title":"Minicraft Plus 1.9.4 Pre-Release 6","body":"<h2>Bug Fixes</h2><ul><li>Fixed wool coloration</li></ul>"},{"id":"minicraftplus_1.9.4-pre5","title":"Minicraft Plus 1.9.4 Pre-Release 5","body":"<h2>Additions</h2><ul><li>Added save tip</li></ul>"},{"id":"minicraftplus_1.9.4-pre4","title":"Minicraft Plus 1.9.4 Pre-Release 4","body":"<h2>Changes</h2><ul><li>Implemented ITEM OVERHAUL</li></ul>"},{"id":"minicraftplus_1.9.3","title":"Minicraft Plus 1.9.3","body":"<h2>Added</h2><ul><li>Added command line argument to change the save directory of the world files.</li><li>Added back feature where mobs stay away during the first night.</li><li>Loading has a progress bar. Though honestly, it doesn't need one.</li></ul><h2>Changes</h2><ul><li>Revised input system to (hopefully) work on any language keyboard/computer.</li><li>Reduced world load time from 2 seconds to about half a second, for me). It used to generate new levels needlessly, but now it doesn't.</li></ul>"},{"id":"minicraftplus_1.9.2","title":"Minicraft Plus 1.9.2","body":"<h2>Added</h2><ul><li>Added Key Binding Menu, finally! You can now customize key controls, and save them. Accessible from the title screen, and the pause menu.</li><li>Added spanish keyboard(/computer?) support... for the enter (and backspace) key... but that's all you need to access and change the key binding menu.</li><li>world difficulty is saved for each world</li></ul><h2>Changes</h2><ul><li>Key bindings, sound, and autosave options are loaded on startup, in a special file that applies to all saves; like beating the second airwizard.</li><li>renovated entities</li><li>renovated menus, a bit</li><li>HUGE renovations to the code; might not see many changes to functionality, but entirely new bugs are bound to crop up...</li></ul>"},{"id":"minicraftplus_1.9.1","title":"Minicraft Plus 1.9.1","body":"<h2>Changes</h2><ul><li>Armor now functions as a damage buffer rather than extra hearts; you take damage after only a certain number of damage points accumulate.</li><li>Armor lasts longer.</li><li>Rate of hunger bar healing health depends on hunger; still happens when less than full health.</li><li>Added version number to save file</li><li>Hunger bar now decreases in a better way (in my opinion)</li><li>Fixed all the bugs I could find!</li></ul><h2>Removed</h2><ul><li>Removed player's restriction on movement while being hurt</li></ul>"},{"id":"minicraftplus_1.9.0","title":"Minicraft Plus 1.9.0","body":"<h2>Added</h2><ul><li>Game window is resizable</li><li>Added debug features</li><li>More entries in debug display</li><li>Key preferences... well, kinda. You can't really change them...</li><li>Modifier keys supported (shift, alt, ctrl)</li><li>Added obsidian brick and door to creative inventory</li></ul><h2>Changes</h2><ul><li>Airwizard suit status and key prefs saved with game file</li></ul>"},{"id":"minicraftplus_1.8.0","title":"Minicraft Plus 1.8.0","body":"<h2>Added</h2><ul><li>Spawners &amp; underground mini-dungeons</li><li>Added colored clothes to change the player's outfit. They are craftable in the loom, or dropped rarely by zombies.</li><li>You can set the timer for score mode: 20m (default), 30m, 40m, or 1h</li><li>You can unlock new score mode times with high enough scores: 10 min and 2 hours.</li><li>&quot;Airwizard II&quot; boss shows up on the surface after you unlock all the locked chests</li><li>Once you defeat the Air Wizard, you can wear his costume by going into the settings menu. This suit allows the player to walk on air tiles.</li></ul><h2>Changes</h2><ul><li>Airwizard's health appears above his head</li></ul>"},{"id":"minicraftplus_1.7.0","title":"Minicraft Plus 1.7.0","body":"<h2>Added</h2><ul><li>Save/Load words</li><li>Potions</li><li>Added locked chests in purple dungeon</li><li>Added an Iron Lantern at the entrance of the purple dungeon</li><li>Keys to open the chests are dropped by knights</li></ul><h2>Changes</h2><ul><li>Updated pause menu</li><li>A death chest will appear if you die, allowing you to retrieve your stuff.</li></ul>"},{"id":"minicraftsquared_2.7.0","title":"Minicraft Squared 2.7.0","body":"<h2>Additions</h2><ul><li>Improved desert by making world generator generate cacti saplings</li><ul><li>Note that these will have delayed aging.</li><li>If everything will work properly then 2.8.0 or 2.9.0 may extend sapling generation.</li></ul><li>Made seasonal splashes for: birthday of: mod author, mod itself and modder's fav anime character. (bc why not lol), halloween, valentines</li><li>Added new worldgen setting</li><ul><li>Additional stonemass level. You can set it from -1 to 5. The bigger number the more stone will world generator generate.</li></ul></ul><h2>Visual Improvements</h2><ul><li>Instead of blinking for shortened display hearts , hunger and thirst will now wiggle if low.</li><ul><li>Same for traditional but there only hearts which are filled to at least half will wiggle.</li><li>Burgers and droplets will also start wiggling whenever you are about to lose another hunger or thirst point</li><li>Armor bar and health bar will also wiggle simultaneously when player takes damage. The more damage is taken the longer it will wiggle.</li><ul><li>This also applies to Shortened display</li></ul><li>Thank you @TheBigEye for this great idea : )</li></ul><li>Added better inventory display. There are plans to furthermore improve display in 2023</li><ul><li>Searching for now may be a little bit buggy but 2.8.0 should fix it next year.</li></ul></ul><h2>Changes</h2><ul><li>Stairs changes:</li><ul><li>Stairs can spawn slightly closer to themself</li><li>However some of stairs will now be buried meaning that if you try to use upstairs from lower floor you will be unable to move up one level(you can still use your escape potions)</li></ul><li>Worldgen changes and tweaks:</li><ul><li>In short worldgen should now be less messy and overall generate better worlds. Bigger worldgen changes are planned for 3.0.0</li></ul></ul><h2>Details</h2><ul><li>Changed flower generation a bit to make flower patches look less messy.</li><li>Added beaches and changed way of generating eyes... SORRY I MEANT ICE. Credits to @TheBigEye for beaches code.</li><li>Beaches worldgen was partially improved by me for needs of this branch</li><li>Tundras shouldn't generate next to deserts or drylands anymore. However if you see singular rocks known from drylands know that it's intentional to make your world look nicer ;)</li><li>Added ground rock beaches for levels -3 and -4</li><li>For -4 level also added occasional NORMAL singular ground rocks. Despite that you will now see many singular ground deepslate rocks all around the floor</li><li>-4 level should now have more landmass (before most of landmass was one big lava ocean)</li><li>-3 level no longer has tiny water ponds on moss biome</li><li>Island and box themes should generate more stonemass</li><li>Island ,Irregular and Box themes also have altered way of generating ground rock on surface</li><li>Stairs now have their own structure which for now will spawn at floors: -1 and -2</li><li>Less spiky stones should now generate on -3 moss floor terrain</li></ul><h2>Bug Fixes and Others</h2><ul><li>Fixed ice generating inside glaciers on hell world settings</li><li>Fixed desert grass not dropping plant fibers</li><li>Optimized stat rendering code for traditional display</li><li>Fixed ground rock not spawning while world is going to have irregular terrain type</li><li>Made castles spawn only on land and only on plains</li><li>Removed exclamation mark from potion display text</li><li>Fixed glacier tiles not melting when very close to lava. Same with brambles</li><li>Added creative mode option to toggle cave darkness. (Press Shift-L to toggle on/off cavelight)</li><li>There are more creative mode-only options planned to add after 3.0.0 release</li></ul>"},{"id":"minicraftsquared_2.6.1","title":"Minicraft Squared 2.6.1","body":"<h2>Bug Fixes</h2><ul><li>Crude tools require 2 more sticks and 1 more stone each.</li><li>Fixed splashes bug that triggers during december</li></ul>"},{"id":"minicraftsquared_2.6.0","title":"Minicraft Squared 2.6.0","body":"<p>Christmas is coming and I am here to serve you Update 2.6.0 which will improve our tundras and as always will add more awesome stuff that will improve your experience with Minicraft Squared.</p><h2>Additions</h2><ul><li>Added fungus spores which you can use to farm big fungi</li><li>Changed generating of vegetation in gold cave floor</li><ul><li>Now most of current big fungi will be replaced with spores which maturation time is very very vary. Sometime they may become mature quickly, while the other time it may take way longer for one to mature.</li><li>Naturally generated reed will now have way more vary maturation time.</li></ul><li>Partially replaced wooden tools with crude tools. They will no longer require workbench to craft but will require many primitive materials instead such as stones, sticks and strings.</li><li>Added plant fibers that can be used to craft strings. You can gain them from gathering tall grass that spawns naturally on the world</li><li>Improved tundras</li><ul><li>Now dead trees can generate in tundras</li><li>Big ice blocks will now generate along with icicles in tundras aswell</li></ul><li>Added patch vases</li><ul><li>Patch vases will allow you to farm any kind of plant on any world floor.</li><li>For now you can farm cloud cacti and surface cacti on these. In 2.7.0 you will be able to farm more plants on it</li></ul></ul><h2>GoL/Utilities</h2><ul><li>Corrected spawner dungeon spawn in the world</li><li>Increased max fps: 300 --&gt; 400</li><li>Increased min fps: 10 ---&gt; 30</li><li>Drylands can now be set as dominant biome while creating world</li><li>Made swimming animated (sprite of swimming will now move)</li><li>Now in title screen you will see if you have the latest version or I dropped new update(I finally got it to work jeez)</li><li>Since skin changing while in-world was causing problems and it didn't have much sense the option has been hidden(in menu it is still available and always will be so don't worry ;D )</li><li>When you have water nearby farmlands it will now have darker texture. However keep in mind that in previous and in this version watered farmlands are more efficient and make crops grow faster.</li></ul><h2>Balancing</h2><ul><li>More cavern stairs will generate on bigger worlds. Also added formula that should prevent from spawning too much downstairs at the world edges</li><li>Cloud cactus can drop up to 4 cloud shards instead of 3</li><li>Well Fed/Hydrated is more efficient. Previously its effect was too weak to be worth of obtaining.</li><li>Now when walking on crops they won't destroy instantly on step.</li><li>You can no longer fish crude shovels but you can fish good old wood swords</li><li>Wood/Crude tools balance changes:</li><ul><li>As wooden tools have been partially replaced with better conception, each crude/wooden tool will have +2 durability upon crafting</li><li>Wood swords now require 1 string.</li><li>Wood claymores will require 1 more string while crafting these with usage of blood shards.</li><li>Wood claymores require less blood shards while crafting.</li></ul><li>10 stamina allows to sprint for a little bit longer</li></ul><h2>Bug Fixes</h2><ul><li>Fixed bugged splashes during december</li><li>Fixed lily pad not dropping flower while its destroyed due to stepping on it</li><li>Fixed candy tier durability display in creative mode (and fixed it overall)</li><li>Fixed mobs behaviour</li><ul><li>Mobs won't step on ice unless they can fly above it like Night or Air Wizards or Zombies, Skeletons or Slimes while Night Wizard is alive providing extra abilities to hostile mobs</li><li>Player of course is able to move on ice that floats on water.</li></ul></ul>"},{"id":"minicraftsquared_2.5.0","title":"Minicraft Squared 2.5.0","body":"<p>How it's going folks? It is me pelletsstarPL and I am bringing you update 2.5.0 for Minicraft squared. This update adds many QoL and gameplay improvements along with balance changes and bugfixes as always.</p><h2>Additions</h2><ul><li>Added critical hits for melee weapons and changed balance for arrows and their crits</li><ul><li>Axes have the biggest chance from all weapons to score critical hit even if it does less damage than sword.</li><ul><li>Order of crit chances from biggest to lowest: Axe , Claymore , Bow , Sword</li><li>Note that crit chance bonuses do not apply to bosses. Bosses have sword's crit chance.</li></ul><li>Crit multiplier stacks with Power potion multiplier</li><li>Crit multiplier and overall arrow damage to non-player mobs have been increased to make bows more worthy</li><li>When crit damage is dealt to player it will simply do damage increased by 1 point.</li><li>Skeleton can score crit while shooting accidentaly on other mobs as well as player can score crit while shooting mob with bow's arrow.</li><li>Weak potion effect disables crit chance for player</li></ul><li>Now healthy eating is worthy. Now consuming healthy products can give you Well Fed or Well Hydrated effect depending on what did you eat recently.</li><ul><li>Note that whenever you get Hunger or Thirst effects your Well Fed/Hydrated effect will be instantly removed</li><li>Chance and duration is calculated by formula: If for instance steak is restoring 8 hunger points and at this moment you have 16 hunger points then:</li><ul><li>16+8=24 . Now we remove 20 out of 24 and we get 4.</li><ul><li>Effect occuring chance: 4*3%</li><li>Effect duration: 4*5 seconds</li></ul></ul><li>Well Fed/Hydrated slows down your Hunger/Thirst stat drop while active</li><li>You cannot trigger Well Fed/Hydrated to overwrite its negative versions</li></ul><li>Milk can be now obtained from cow</li><ul><li>Drinking milk shortens potion effects that are not natural like Speed, Shield</li><li>You can also milk cow using Bucket.</li><ul><li>You can also drink entire Milk Bucket however you will need full stamina and get Fatigue effect for short time afterwards recovering thirst equal of 4 Milk bottles recovering.</li><li>As of drinking entire bucket potion durations will be shortened by way bigger time.</li></ul><li>You can also milk cow using Bottle</li></ul><li>Bonemeal now can spawn tallgrass and flowers when used on grass.</li></ul><h2>Balancing</h2><ul><li>Axe combat damage increased , however the best choice while in combat still will be the sword. It's even better when you have claymore in your equipment of course.</li><li>Dirty water bottle has been added to junk items fishing rod loot table.</li><li>Crafting recipe for &quot;Potion&quot; item now uses glass bottle instead of glass</li><li>Herb tea now has very very low chance to recover 1 HP upon drinking</li><li>Haste potion effect recovers stamina 1% faster.</li><li>Maximum amount of enemies single arrow can damage has been reduced: Infinity ----&gt; 2 .</li></ul><h2>World Generation Changes</h2><ul><li>Added more skystone on the sky floor</li><ul><li>In later updates skystones may contain more special stuff. Who knows maybe some downstairs to sky caverns?</li></ul></ul><h2>Other</h2><ul><li>Fixed thirst inconcistency when using potions</li><li>Fixed potion effect positioning for longer potion names.</li><li>Fixed Poison potion name</li><li>Drinking potions now refund bottle as it should (smh it was overlooked issue since 1.0 until now)</li><li>Having only potion effects caused by eating poisonous food, drinking unhealthy drinks shouldn't make player emit bubbles.</li><li>Rewritten shearing sheeps so now its cooldown until next shearing is possible is saved properly</li><li>Fixed max FPS not saving on game load. Now it sets max fps automatically without having to enter options every single time.</li><li>Fixed stamina not saving with other player stats while saving the game(this bug also applies for minicraft plus but only it has been fixed in this branch)</li><li>Replaced image on game start with better one and using new logo.</li></ul>"},{"id":"minicraftsquared_2.4.0","title":"Minicraft Squared 2.4.0","body":"<h2>Additions</h2><ul><li>Added cloud flowers for sky floor</li><li>Added ferns. You can gather them for spores that you can plant on grass. Mostly they spawn in swamps but rarely can appear in the forest as well.</li><li>Conifer trees on sky have been replaced with new variation that is purple and has white trunk</li><li>Added final mineral block: Gem block. Place it and feel preetiness filling you inside out.</li><li>Added new biome: Swamps. Inspired by actual cave biome from gold floor with addition of new trees: Mangroves.</li><li>This biome is dedicated to 256x256 worlds and above but will still generate on 128x128 but will be very small.</li><li>On this biome except mangroves you can find azaleas , oak trees , ferns and big fungi.</li><li>Most of swamps is covered with moss.</li><li>With hell setting there are no Mangroves and all you have in their place will be dirt tiles everywhere</li><li>World creation settings has been changed: From now you have 2 labels related to world theme instead of one:</li><ul><li>World theme which will have now only two options: Normal and Hell</li><li>Dominant biome which will let you specify which biome do you want to be mostly generated.</li></ul><li>Added swamps option along with new biome</li><li>Worldgen changes</li><ul><li>Except new biome from now mountains are also being made from rock that leaves stoney surface when destroyed(that stone you had already occasion to face in caves)</li></ul><li>Added lily pads</li><ul><li>Some lily pads will contain flower on top of these. When you collect'em you will get both lily and the flower.</li><li>Lily pads spawn in new biome and inside gold cave floor</li><li>Be careful. Some lily pads may collapse below your feet. When it happens lily pad will destroy itself but leaving its loot behind (lily and flower if it had one)</li></ul></ul><h2>Changes</h2><ul><li>Balancing:</li><ul><li>Hard Rock II health increased: 250 ---&gt; 300</li><li>Night armor changes:</li><ul><li>Damage return ability has been improved:</li><ul><li>Dmg return bonus has been increased: 7% -----&gt; 10%</li><li>Chance for DR to occur has been increased</li></ul><li>Night armor has been changed yet again. Now this armor won't work only when you are on surface or above and it is day. Since caves are very dark places night armor can work there and protect you from damage just like it would normally do at night.</li><li>Note: armor will protect like leather one during the day on the surface. At night it will protect you as it normally would be.</li><li>Following effects: Damage return, healing from tier 5 monsters will still work only during the night.</li></ul><li>Airwizard drops cloud shards and clouds upon death</li><li>Night wizard II drops 30 blood shards upon death</li><li>Night wizard has smaller chance to teleport away</li><li>Golden claymore can be crafted with blood shards</li><li>Axes do slightly more damage to mobs</li><li>Now collecting ground rocks always provide 1 stone. With shovel it has low chance for two</li></ul></ul>"},{"id":"minicraftsquared_2.3.0","title":"Minicraft Squared 2.3.0","body":"<h2>Additions</h2><ul><li>Bone meal now works as it is supposed to</li><li>As Ben Forge suggested actual burning mechanic for tiles should be implemented when they rewrite Minicraft+ saving.</li><li>Rewritten Air wizard so it uses 1 file instead of 5 for their phases</li><li>Added gold block</li><li>Made some coarse dirt generate on Iron/Gold floor and even more water pools</li><li>Added warning when creating 512x512 world as it uses most performance.</li><li>Added my victorious book from playminicraft discord contest titled &quot;The hot day&quot;. The theme of contest was summer. Find it occasionaly buried in sand. Note: you can only find one per world.</li></ul><h2>Changes</h2><ul><li>Changed mechanics for Coal filter. Now one allows you to purify 3 bottles of water before being used up</li><li>Purified water has further reduced chance to give Thirst effect</li><li>You can use moonlight totem at evening but keep in mind that Night wizard will still sleep</li><li>Castle knights have a little less health</li><li>Lifetime of an items that lie on the ground have been slightly increased but from now they can burn in lava... except Demonicolon and summoning totems</li><li>Reduced amount of Blood shards required to craft claymores</li><li>Now every normal night increases chance for bloodmoon to happen next night by 5%. Additional chance goes down to 0 once bloodmoon occurs.</li><ul><li>Night wizard balance changes:</li><ul><li>When night wizard goes to sleep he will clean all negative effects he has(burning and others that will be added in future updates)</li><li>Now night wizard should be able to teleport behind the player not just in the way the player punched him</li><li>Now night wizard shouldn't teleport very far from the player. He will still teleport away but on short distances</li><li>Night wizard starts fight on both tiers with less health.</li><ul><li>Tier 1: 3000 ----&gt; 2400</li><li>Tier 2: 4000 ----&gt; 3000</li></ul><li>The closer night wizard is to die the bigger additional player detection distance some hostile mobs have. It is additive increase not multiplicative. Once night wizard is killed it goes back to normal</li><li>If night wizard will ever teleport himself inside the rock he'll fly over it and land on surface to continue fighting you. This change should make boss fight a little easier.</li><li>Night wizard can make mobs spawned by him be able to walk on water. You will see small moonlight platform below them while they are on water. However when night wizard dies all hostile mobs spawned by him walking on water will drown leaving no drop behind.</li></ul></ul><li>Night armor changes:</li><ul><li>To make Night Wizard II more rewarding now Night Armor can trigger Power potion effect on the same conditions as Time. There is a chance to get both Time and Power at the same time. It will still consume only 1 hunger point even if it provides you 2 potion effects.</li><li>Chance for triggering potion effects has been increased to 3%</li></ul></ul><h2>Bug Fixes</h2><ul><li>Fixed bug with arrows colliding with wool instead of flying over it.</li><li>Fixed airwizard being unable to walk on wool.</li><li>Now you are able to normally fill the empty bottle when thirst is full</li><li>Optimized obsidian dungeon generation a bit making it also better overall</li><li>Fixed worldgen in some places. For example now game should finally generate other biome added to gold cave floor back in 1.1.0. For some reason it was generating only moss one.</li><li>Bloodmoon should now trigger properly</li><li>Night wizard couldn't fight when he was outside the map. Now whenever he will be outside of map he'll be teleported back on the map</li><li>Messages for night and airwizard II beats go over the screen. It shouldn't happen anymore.</li><li>Fixed bug when game lags for short while when game is paused for longer while</li><li>Optimised night wizard boss fight</li><li>Fixed Dead tree on coarse dirt connecting to sand texture</li><li>Now Ground stone should work properly and its texture should display properly</li><li>Torches couldn't be placed on path tiles</li><li>Splash particles for water were rendering while player was not swimming. Now these should only render them while player is actually moving while swimming.</li></ul>"},{"id":"minicraftsquared_2.2.2","title":"Minicraft Squared 2.2.2","body":"<h2>Changes</h2><ul><li>Ores now should use new damage handle. In 2.3 or 2.4 further balance changes related to these are planned</li></ul>"},{"id":"minicraftsquared_2.2.1","title":"Minicraft Squared 2.2.1","body":"<h2>Changes</h2><ul><li>Spiky stones no longer drop coal</li><li>Mining chopping requires at least 3 stamina bolts</li></ul><h2>Bug Fixes</h2><ul><li>Fixed brambles not getting damaged when using non axe tools</li><li>Fixed saveload</li></ul>"},{"id":"minicraftsquared_2.2.0","title":"Minicraft Squared 2.2.0","body":"<h2>Changes</h2><ul><li>Added Stonecutter</li><ul><li>Crafting stone/obsidian bricks and doors is no longer possible with workbench. You can still craft walls in workbench.</li><li>Added shortened display for player's stats. You can toggle to traditional in options. By default traditional display is set.</li></ul><li>Another update and another ore block has been added: Iron block.</li><li>Power potion is now craftable (combine it with claymore for massive damage against high tier mobs)</li><li>Added Litorom 's ornate tiles along with one made by me.</li><li>Improved spawner dungeon generation for levels -1 to -4.</li><ul><li>Added ruined display for iron and gem level dungeons and improved already existing.</li></ul><li>Chance for more land on stairs up generation in caves is increased</li><li>Now obsidian dungeon entrance should generate at center of the world at any size not at specific 60x and 60y coordinates</li><li>Worldgen:</li><ul><li>Villages have been improved. Now you can see fountain ruins not only in caves but also on surface as a part of village. Depends on world theme they appear dry, frozen or full of water but are almost always ruined.</li></ul><li>Expanded the whitelist of tiles on which village houses/fountains can generate.</li><li>Villages generate with more houses: from 2 to 5 instead of from 2 to 4.</li><li>Stairs down on sky floor can't just generate on cloud tile</li><li>Sky floor world is now improved. You can see trees, cloudy grass and more of cloudy cacti. Reminder: You can farm cloud cacti.</li><li>Lava now when touched by any mob burns it. In 2.3.0 it is planned to significantly improve burning mechanic</li><ul><li>Balancing:</li><ul><li>Lava now deals twice as much damage to non player mobs</li><li>(ik it is ripped from minecraft)When passive mob is burning will drop cooked version of it's meat. However burning remaining duration must be over 150 ticks left when mob dies.</li><li>when sheep gets burned to death it won't drop wool</li><li>As for now changed message for Hard Rock II when trying to destroy it in survival(this green rock on sky floor)</li></ul></ul></ul><h2>Bug Fixes</h2><ul><li>Fixed bug with walls being unbreakeable</li><li>Fixed bug with airwizard I unable to move when spawned on water/lava</li><li>Fixed bug with creepers crashing the game</li><li>Fixed flowers display on the world</li><li>Fixed castle chest spawning ... finally... the solution was that easy (i suck at coding lol)</li><li>Fixed airwizard phase 3 and 4 blinking sprites. Now it should use proper sprites for the animation</li><li>Fixed reed not generating on gold cave floor that occured since many versions. For small stones on gem floor changes are postponed to 2.3</li><li>Fixed day and night cycle not working on creative. As a part of creative mode you still will be able to see everything underground.</li><li>Fixed often mobs despawn. Further fixes for it are planned for 2.3.0 release</li><li>Fixed potion timer display when there are less than 10 seconds left</li><li>Fixed mines generate inside the stone</li><li>Found somewhere lost colored gui toggle. Gui will be still colored by default.</li><li>When deleting your only world it led to old menu where you could access old single/multiplayer menu. Now it is fixed.</li><li>It is no longer possible to collide with ghosts and wraiths. However keep in mind that wraiths still develop ancient power that lets them harm you.</li></ul>"},{"id":"minicraftsquared_2.1.0","title":"Minicraft Squared 2.1.0","body":"<h2>Additions</h2><ul><li>Added splash and burning particles when swimming in water and lava</li><li>Added lapis block. Now I am going to add block of one of the ores every update starting from Lapis ore.</li><li>Added new event: Bloodmoon</li><li>Every night except first there is a chance that moon will become bloody. Chance does not increase after every normal night, so do not worry much about it.</li><ul><li>While bloodmoon monsters spawn one level higher and with higher frequency... be careful</li><li>Bloodmoon can summon very hostile, dangerous tier 5 mobs. The chance for them is very low but is doubled when you play hardcore.</li><li>While Bloodmoon all surface and above hostile mobs can drop blood shards which can be used to craft claymores but up to iron level</li><li>While Bloodmoon the surface and above is entirely covered in red.</li><li>During Bloodmoon hostile mobs can spawn on clouds and skygrass.</li><li>While Bloodmoon the world darkens almost instant, even if the evening just began, but it is to give you time to prepare.</li><li>During bloodmoon you are not able to use a be</li></ul><li>Added Night Wizard II:</li><ul><li>Can be summoned when you use Moonlight Totem during the Bloodmoon</li><li>Can evolve from its 1st level when he wakes up during the Bloodmoon</li><li>If Night Wizard II is not defeated on time he will go sleep just like its tier 1. But if the next night will be normal, Night Wizard will downgrade himself to it's Night Wizard I form.</li></ul><li>Added night armor - loot it from newly added Night Wizard II</li><ul><li>Has 180 armor points but works only during night.</li><li>During the day provides no protection but still can do something with very low chance.</li><li>Works on any world level as long as there is night on the surface.</li><li>Cannot be replaced with any other armor once worn unless you'll lose all armor pts provided by it.</li><li>If tier 5 or above enemy is killed during the bloodmoon it heals player by 3 HP per killed enemy (regardless of hunger/thirst levels) with 100% chance. (does not apply to wraiths summoned by air wizard)</li><li>Once player gets damaged when armor works there is 2.5% chance to trigger Time potion effect for 4 seconds at a cost of 1 hunger point regardless whether night is at the moment or not.</li><li>During night has 5% (20% during bloodmoon) chance to return full melee damage dealt by monster plus wipe 7% of their total health(does not apply do Wizards)</li></ul></ul><h2>Changes</h2><ul><li>TNT explosion now emits light(in 2.2 it is planned to make creepers explosions emit light if possible)</li><li>Changed colours for potion texts , as for energy potion display of stamina bar has also been changed</li><li>Balancing:</li><ul><li>Hostile mobs can spawn on surface during the evening from some point instead of only night</li><li>Still to loot some blood shards out of mobs during Bloodmoon a night must start and the evening must end.</li><li>Cooked porks,beef,fishes restore 1 hunger point more</li><li>Now cooked porks and steak restore 5 hunger points</li><li>Now bread restores 4 hunger points instead of 3</li><li>Snakes have bigger chance to apply venom.</li><li>Wanna take a rest from these blasty walking bombs called creepers? From now they no longer place their full of gunpowder feet on sky floor.</li><li>Are tier 4 and 5 monsters tough? Try buffed claymores. Now when you face these hazardous monsters entire damage done is multiplied by 1.33 . Especially try with Power potion that will be finally craftable in 2.2.0 release.</li></ul></ul><h2>Bug Fixes</h2><ul><li>Fixed bug with &quot;Wear suit&quot; option not displaying on world menu and displaying in wrong moment</li><li>Fixed bug with darkness on sky floor during the day.</li><li>Removed rpc since it was causing problems. It should return in 2.2.0</li></ul>"},{"id":"minicraftsquared_2.0.0","title":"Minicraft Squared 2.0.0","body":"<h2>Additions</h2><ul><li>Added frames to title screen , Load/New world options, Skins tab and Help tab</li><li>Added proper balancing for starvation/dehydration damage.</li><li>New potion effects:</li><ul><li>Fatigue - slows down stamina restoration and reduces damage you do to trees/stone etc. Your stamina is being reduced faster while swimming on water, so watch out.</li><li>Haste can weaken Fatigue but it only works for stamina restoration and doesn't work against increased stamina loss while swimming during Fatigue.</li><li>Swim potion can still negate this increased stamina loss caused by Fatigue.</li><li>Harm - opposite of Health potion</li><li>Power and its opposite: Weak. Does the same as Strength and Weakness in Minecraft. Remember that if Power and Weak potions work at the same time they negate themself.</li><li>Tier 5 of hostile mobs has been added</li></ul><li>Added revolutionary mechanic: Sprinting</li></ul><h2>Changes</h2><ul><li>On Iron and Gold floor brambles will spawn. Beware!</li><li>Brambles will also spawn in village ruins on surface.</li><li>In dungeon floor unused tile: Lava Brick now will spawn. It leaves lava when destroyed.</li><li>New small structure: Mine. Spawns on first two cave floors. Walls are made out of wood, contains chest with some torches, coal, bread and rarely some ores.</li><li>New biome: Drylands. Full of coarse dirt and rocks. Contains brambles.</li><li>Coarse dirt also spawns underground.</li><li>Cloud floor is a little bit bigger and contains more skygrass</li><li>Cloud floor contains more skystone</li><li>Between iron and gold floor a new world floor has been added. Another one between gem and gold floor is planned for one of further releases.</li><li>This floor doesn't contain much free space. It contains tiny ponds, few free spaces, almost no structures. Here you can find iron AND gold ores but dominant is iron.</li><li>Deepslate with ground stone underneath it now spawns just like stone with ground stone under on higher floors.</li><li>There is very , very small chance that the square around the upstairs will be 5x5 instead of 3x3 on any floor.</li><li>Energy potion duration: 2m16s --&gt; 1m26s</li><li>Healing potion health restoration rate: 5 ---&gt; 6.</li><li>To make obsidian dungeon harder now Wraiths can spawn here and always with tier 4.</li><li>Snakes are now venomous. Their venom now has a chance to give you one of following effects: Poison, Hunger, Thirst, Weak, Fatigue. The higher level snake is the higher chance it has.</li><li>Snake does 1*lvl damage instead of 2*lvl at a cost of new ability.</li><li>Knights now do 2*lvl damage instead of 1*lvl</li><li>You get hungry/thirsty slower on Hard to make this mode more playable.</li><li>Fishing gets interrupted if player moves</li><li>When spawner is destroyed your tool will lose durability.</li><li>Tier 3 knights now wear golden helmet</li><li>Tier 4 knights now wear full golden armor</li><li>These are just visual changes and won't affect actual fight.</li><li>removed &quot;^&quot; from game logo</li><li>removed &quot;+-+...&quot; from ingame info</li><li>game window title now instead of &quot;^2&quot; has </li><li>Crafting ui changed a bit.</li><li>Changed default key binding for searcher bar from F to Shift-F.</li><li>If any potion effect is active a bubbles will fly out of a player.</li><li>changed code of dead trees worldgen on the desert</li><li>Replaced yellow dashed lines with frame... red frame in options tab.</li><li>Frames for other gui parts are planned to be added in next updates</li><li>Charcoal: you can now use it in oven , furnaces. Obtainable from burning wood logs in furnace. That's why some recipes are now duplicated to support both variants of coal.</li><li>Changed content of about and story to make it fit Squared.</li><li>Corrected name for shears.</li></ul><h2>Bug Fixes</h2><ul><li>Fixed bug with deepslate spiky stone. It's lava version wasn't emitting any light unlike plain lava.</li><li>Fixed Hardcore mode. Now Hard difficulty should be applied instantly when you enter the world. Option for changing the difficulty while on hardcore is now locked.</li><li>Respawing is no longer available on hardcore mode.</li><li>Worldgen now should be way faster. ~ thx @TheBigEye for fix</li><li>Fixed negative dmg from tnt explosion which was causing 'harmed' mob to heal or even overheal.</li><li>Damage to the player from starvation, drowning is no longer affecting your armor. That means, you won't lose your armor points and armor will no longer protect you against damage from these sources.</li></ul>"},{"id":"minicraftsquared_1.9.0","title":"Minicraft Squared 1.9.0","body":"<p>Totally not a joke</p><h2>Added</h2><ul><li>Gem lantern</li><li>New wool colours</li><li>Bonemeal</li><li>Cloud shards, and cloud cactus saplings</li><li>New dyes and recipes</li><li>New clothes</li></ul><h2>Changes</h2><ul><li>Added small spikes to cloud cactus texture.</li><li>Cloud cactus can now be farmed just like Reed, wheat but it takes longer than any other plant to mature.</li><li>Green Clothes became Lime Clothes, Green wool became Lime wool. Green clothes and wool have new texture.</li><li>Black Clothes are darker</li><li>When lava burns a tile it displays particles</li><li>Lava now burns all wool tiles.</li><li>Moved Bed recipe for Loom to the top due to bunch of new recipes related to new wool and clothing colours</li><li>When TNT or Creeper is fused its texture will blink.</li></ul>"},{"id":"minicraftsquared_1.8.0","title":"Minicraft Squared 1.8.0","body":"<h2>Added</h2><ul><li>3 new splashes</li><li>New boss, Night wizard</li><ul><li>Can only be attacked at night, during the day he is invulnerable as he regains health for the night (regains 66% of its total health, cannot overheal)</li><li>upon his death he sends dense final wave of sparks.</li><li>Increases level of spawned mobs in overworld during the night. When he sleeps all buffs he has given to mobs are disabled.</li><li>The less health he has, the stronger mobs it spawn.</li><li>Night wizard sleeps from morning to night. During that he cannot be attacked and he doesn't attack by himself.</li><li>Sometimes he sends beam across the world spawning stronger hostile mobs. This beam is made of sparks causing you getting damage.</li><li>Can only be summoned by his own totem and only at night.</li><li>Teleports to random place when he takes some damage.</li></ul></ul><h2>Changes</h2><ul><li>Now Wraith's final scream is played when player is less than 10 blocks away from place where Wraith has died.</li><li>Changed saplings code.</li><li>Fixed rock that leaves ground rock after being destroyed . Now damage should apply normally to that.</li><li>Totems</li><ul><li>Airwizard I and Night wizard can be summoned by totems</li><li>Airwizard I totem works only in overworld and levels above.</li><li>Night Wizard totem works only in overworld and only during the night.</li></ul><li>Stone tools need less wood logs while crafting them</li></ul>"},{"id":"minicraftsquared_1.7.0","title":"Minicraft Squared 1.7.0","body":"<h2>Added</h2><ul><li>Added Ice. Ice has a chance to cracking under your or mob's feet turning ice tile you are stepping on into a water tile.</li><li>Added snow. You can use 2 pieces of snow to create a placeable snowlayer.</li><li>Two new world themes: Taiga &amp; Tundra.</li><li>Added ground stone, a stone that you can walk on. You can mine it for some stone. It spawns in all cave floors.</li></ul><h2>Changes</h2><ul><li>Taiga world theme replaces 99% of oaks and birches with Spruce tree.</li><li>Tundra world theme covers most of the world with snow.</li><li>Both of new biomes generate normally. Note that due to make world have more biomes creating world process takes longer sometimes way longer.</li><li>For irregular tundra almost all water on the world is frozen.</li><li>For mountain terrain type water lakes that spawn inside the mountains are frozen.</li></ul><h2>Technical Changes</h2><ul><li>Fixed skins</li><li>Mechanics for snow and sand has changed. Now when you dig sand you'll see dirt... just like in Eye's Aircraft. I implemented that change</li><li>Due to new lava mechanic that causes snow nearby lava to melt turning into dirt tile.</li><li>Lava is now removing trees that are near it turning tree tile into dirt tile to simulate burn effect. Same goes for wooden planks,doors and doors.</li><li>Some changes in structures generation.</li></ul>"},{"id":"minicraftsquared_1.6.0","title":"Minicraft Squared 1.6.0","body":"<h2>Added</h2><ul><li>Added Clallay, new passive mob, unique for Sky Floor. Immune to cactus cloud. Drops nothing upon his death.</li><li>Added small structure made from 2nd tier of Hard Rock. When trying to destroy it will require Zanite pickaxe which isn't available for now, but in future updates zanite tools may be obtainable and inside of the structure stairs are planned to be added.</li></ul><h2>Changes</h2><ul><li>Some skygrass and skystones can now spawn on Sky floor.</li><li>Candy items can now spawn in dungeon chests.</li><li>Juices can be found in dungeon chests.</li><li>Golden apple juice now regains even more thirst and can be rarely found in dungeon chests.</li><li>Wraiths have smaller range of detecting the player except Wraiths spawned by Airwizard.</li><li>When you have blind and light effects at the same time you'll just see a little instead of nothingness.</li><li>Droprates for flowers have changed (you can no longer get rose from daisy flower tile)</li><li>Spiky stones spawn inside of mountains when terrain type is set to Mountain.</li><li>When Mountain terrain type is set there is low chance for Iron ore instead of spiky stone. Spiky stones and eventually iron ores spawn are random but spots for them are the same, so even if you use the same seed you may get spiky stones in place of iron ores.</li><li>Implemented ALICE'S pixel. Pixel is a library that allows to use sheets that are bigger than 256x256. It is required to continue mod development.</li><li>Now torches can be placed on moss.</li></ul><h2>Fixed</h2><ul><li>Fixed bug with respawning Airwizard on skyfloor.</li><li>Fixed Blindness effect. Now it should work properly.</li><li>Fixed bug with \\&quot;Reed Seeds\\&quot;.</li><li>Other minor fixes.</li></ul><p>NOTE: During PIXEL implementation a bug has sneaked into the game code. It is related to skins. Just enter and leave skins tab in main menu to fix it. This may be fixed by me in 1.7 or 1.6.1 .</p>"},{"id":"minicraftsquared_1.5.0","title":"Minicraft Squared 1.5.0","body":"<h2>Added</h2><ul><li>Flesh - new zombie loot and food. Isn't healthy has very low chance to put poison with hunger at the same time.</li><li>Beetroot ,its seeds and its juice. You can obtain Beetroot seeds with low chance while turning grass into farmlands.</li></ul><h2>Changes</h2><ul><li>There is even lower chance to get beetroot seeds from destroying tall grass.</li><li>Tall grass for overworld.</li><li>Tall grass can spawn on sand.</li><li>Display of item in bottom ui has been graphically improved.</li><li>On overworld near big rocks and in underground small rocks will spawn on ground. It can be digged with shovel. Has 40% chance to drop 1 stone with shovel and 10% by hand.</li><li>Increased sheet of item ids from 256 to 512.</li><li>In dungeons you can see dirt along with raw obsidian and obsidian bricks.</li><li>Obsidian ores generate in dungeons.</li><li>Tried to fix some world generation crashes and improve worldgen at the same time.</li><li>Reed now generates on ponds instead of island shores or rivers.</li><li>Removed latest link to Mc+</li><li>Gave you a smile : )</li></ul>"},{"id":"minicraftsquared_1.4.0","title":"Minicraft Squared 1.4.0","body":"<h2>Changes</h2><ul><li>Now some parts of a gui have a background in different colour.</li><ul><li>If you still wish to have all windows blue go to settings and toggle colored gui off.</li></ul><li>Changed some splashes</li><li>Now Airwizard's invulnerability saves</li><li>Made small trees and dead trees work properly</li><li>Now you can search for specific item in your inventory with F key. You could do it earlier but it was as secret till now. Also it was crashing if some \\&quot;special\\&quot; chars has been entered to the searcher.</li><li>Airwizard sprite now blinks while he's invulnerable. Thanks A.L.I.C.E. for help</li><li>Lava no longer damages wraiths and airwizard</li><li>Wraiths now spawn underground.</li><li>Now except wraiths ghosts will appear underground. Unlike wraiths these are passive mobs and won't attack you. Ghosts can spawn in obsidian dungeon too.</li><li>Ghosts can spawn at night at overworld</li><li>TNT no longer can blow stairs and obsidian walls</li><li>Fixed flowers texture</li><li>For now languages aren't available in both minicraft+ and square so option related to them is deleted from options menu</li><li>Fixed raw obsidian</li><li>Fixed display of stairs for cloud floor</li><li>Some of menus improved</li><li>Since Lantern recipe requires wood and it had stone texture it has been changed so now lantern made out of wood looks way more wooden let's say.</li><li>Spawners now have separate textures. The sprite depends on mob tier that it spawns.The colour of the ars on spawners sides determines the tier.</li><li>Hard rocks can be placed on cloud in creative</li><li>Fixed Err/text for hard rocks texture</li><li>Balancing</li><ul><li>Time to retrieve death chest on Hard has been increased by 10 seconds.</li><li>You get hungry/thirsty slower on Hard.</li><li>Creepers health has been reduced.</li><li>Wooden lantern now requires 4 pieces of glass instead of 3 due to new texture</li></ul></ul>"},{"id":"minicraftsquared_1.3.0","title":"Minicraft Squared 1.3.0","body":"<h2>Added</h2><ul><li>Added blindness potion</li><ul><li>While blind you see pitch black instead of night sky in overworld or skyworld (just like in caves but also in overworld and above)</li><li>Also range of sight is decreased so lanterns provide less light too.</li><li>You cannot read books while blind(unless you are playing on Creative)</li></ul></ul><h2>Changes</h2><ul><li>Ghosts, wraiths</li><li>Airwizard improvements</li><ul><li>Now airwizard is divided into phases. For tier one each one has 500 hp for second one 1000. After every phase except last one Airwizard will spawn Wraiths and become invulnerable until all of them are killed.</li><li>While invulnerable Airwizard will be blinking and will take no damage from any source however he can still attack you and do damage.</li><li>Airwizard now has two types of sparks: first one is that default one and another is arrow-like spark. It's just like normal arrow. He can shot them at two directions at once!</li><li>This new type of sparks he shots when he gets damage. For example: he'll do one shot every 4 hits you do to him</li><li>Airwizard II has something special as revenge for you. Be careful.</li></ul><li>Fixed bottom bars</li><li>Wraiths cannot destroy wheat/reed</li><li>Balancing</li><ul><li>Now eating raw food has a chance to make you get Hunger effect.</li><li>Now eating a gold apple has a 50% chance to give you regen effect for like 2 seconds.</li><li>Drinking dirty or purified water now has chance to give you Thirst effect that works like Hunger but for hydration.</li><li>Purified water has low chance, while dirty water has high one.</li><li>mod author's nickname is now better displayed in game menu</li></ul></ul><p>Note that if you drink both Light and Blind potions you will not see anything. Its intentional, it is not a bug.</p>"},{"id":"minicraftsquared_1.2.0","title":"Minicraft Squared 1.2.0","body":"<h2>Added</h2><ul><li>Added variations of gem ore that will generate on gem floor. Those regardless of different textures will drop normal gems.</li><li>Add moss as an item</li><li>New story book - 11th. Can be found on gold cave floor</li><li>Added spiky stones that appear on lava , water and dirt in caverns in all underground floors. Those don't damage mobs but damage player on touch.</li></ul><h2>Changes</h2><ul><li>Golden floor overhaul</li><ul><li>Stone has mossy texture on golden floor. On any other floor it will still have its normal texture.</li><li>Reed spawns more often in gold cave floor</li><li>Moss generates underground on gold cave floor as well as small water ponds, azaleas, fungi</li><li>Beware of ancient skeleton on gold cave floor. It is a mob exclusive for that underground level. Has 78 health and does the same damage as Tier 4 mob. If the dungeon is going to spawn skeletons those will always be ancient on that floor.</li><li>Ancient skeleton has 1,2% chance to spawn instead of normal skeleton at gold floor.</li><li>Loot table for gold floor mini-dungeons is different</li></ul><li>On gem floor obsidian shores can now generate</li><li>Castles no longer generate at specific coords as it was in 1.1.0 .Now it is random.</li><li>On gem floor lapis appears with way less frequency. In its place you can now find \\&quot;obsidian ores\\&quot; that will drop raw obsidian if mined.</li><li>Now dungeons on gem floor have obsidian walls.</li><li>Now instead of obsidian bricks if water will touch lava it will generate raw obsidian instead of bricks.</li><li>Now on sky floor Tier 3 mobs will spawn as well. That doesn't mean that spawnrate of hostile mobs will be increased.</li><li>Tier 1 hostile mobs no longer spawn at gem floor.</li><li>Main ores of the floor can now appear as \\&quot;not full ores\\&quot;. Those are rare , have different texture and drop less upon mining.</li></ul><h2>Bug Fixes</h2><ul><li>Fixed bug with reed tile where Reed could be use to prevent water from filling holes.</li></ul>"},{"id":"minicraftsquared_1.1.0","title":"Minicraft Squared 1.1.0","body":"<h2>Added</h2><ul><li>New structures</li><ul><li>Wooden farmhouses. Can generate like village house and has some wheat next to it.</li><li>Wooden stonehouses. Can generate like village house and has bunch of natural stone inside and outside of house.</li><ul><li>Both of them have two variations: with two and one door tile.</li></ul><li>Stone ruins - structures generated in Overworld ,now have Mossy and normal stone brick variations combined.</li><li>Second underground floor(that one with gold and lapis) now has unique structure: Fountain ruins.</li><li>Castle ruins(big structures with greater loot). For now those will spawn on specific x and y coords and in 1.2 it's going to be randomized.</li><li>Obsidian dungeon now has lava fountains and mini room. Also dungeon's floor is now mix of both obsidian bricks and raw obsidian.</li><li>Mini dungeons with spawners at Gold floor will use new mossy variations of Stone Bricks.</li><li>Mini dungeons with spawners at Gem floor will have and Lava in the corners of the central room. Central room is bigger</li></ul><li>Added raw obsidian as an item. Can be used to craft obsidian bricks in workbench.</li><li>New hostile mob with two tiers: Knights. Those guard castle ruins. Be careful of Knights that will spawn here. Note that those knights are not the same knights that spawn in the dungeons.</li></ul><h2>Changes</h2><ul><li>Now Obsidian bricks, walls require at least Iron pickaxe to destroy them.</li><li>Now Wooden walls, Stone walls and Obsidian walls will have: 75 , 90 and 120 hit points</li><li>Now except granting 10 golden apples you can now hear a special sound if you found and opened all dungeon chests.</li><li>Improved Minicraft^2 logo</li><li>Main menu now shows Minicraft^2 version instead of Minicraft+ version and MC^2 author</li></ul>"},{"id":"minicraftsquared_1.0.0","title":"Minicraft Squared 1.0.0","body":"<p>Initial Release</p>"},{"id":"minicraftred_1.0.0","title":"Minicraft Red 1.0.0","body":"<p>Netherworld Update</p><h2>Added</h2><ul><li>Added flint and steel</li><li>Mobs can now be set on fire!</li><li>Added Obsidian Portal</li><li>Added a new dimension: the Netherworld</li><li>Added Netherrock</li><li>Added Basalt</li><li>Added Basalt Bricks, Wall and Door</li><li>Added Soul Sand</li><li>Added Piglin</li><li>Added Blaze</li><li>Added Nether Dungeon</li><li>Added Console Commands (Time, Gamemode)</li></ul>"},{"id":"aircraft_b0.5_1","title":"Aircraft Beta 0.5 Pre-Release","body":"<h2>Additions</h2><ul><li>Added Air Wizard Bossbar (A health bar that plans to replace the current life counter).</li><li>Added Beach biome.</li><li>Added Blindness potion.</li><li>Added Cheats option in world gen.</li><li>Added More entries were added to the texture packs.</li><li>Added World gen spalshes (Random messages on world gen screen).</li><li>Added a new Achievements system.</li><li>Added a new level/dimension, The Void (for now it is inaccessible in survival mode).</li><li>Added ambient sound loop in-game (Sky for now).</li><li>Added an little animation to Health potion.</li><li>Added commands... press G!.</li><ul><li>Vsync: set the fps to the refresh rate of the monitor.</li><li>Shadows: disable the shadows of the Items and Particles.</li><li>Particles: disable or enable particles (particles as damage count will still show).</li><li>Bossbar style: change the way the AirWizard's health bar is displayed.</li></ul><li>Added Fireflies :).</li><li>Added Russian localization.</li><li>Re-added colored spawners.</li><li>Re-added shadows to Sparks and Items.</li><li>Re-added swimming animation.</li><li>Added Raw obsidian.</li><li>Added video options (Vsync, Shadows, Particles, Bossbar style)</li><li>Added some events to the game:</li><ul><li>Darkness: it will be presented for 3 days (it limits the player's vision, in addition to only spawning hostile mobs), on the fourth day the night will be normal, without hostile mobs and with fireflies.</li><li>Rain: It will happen after 7 days, it still has no defined utility (can be activated also using the weather rain command and deactivated with weather clear).</li></ul><li>Added full support for cp437 sheet characters.</li><li>Added Discord rich presence (still under development, some bugs may appear).</li></ul><h2>Removals</h2><ul><li>Removed Hard obsidian.</li><li>Removed the old credits menu and replaced it with a new and better one.</li></ul>"},{"id":"aircraft_b0.4_2","title":"Aircraft Beta 0.4","body":"<p>NOTICE: There are still some things that were not implemented, some are implemented but internally deactivated due to recurring errors, these things will arrive in 0.5</p><p>Regarding the tutorial menu, it is possible that it will be rewritten using static sprites of icons.png due to slow development</p><h2>Added</h2><ul><li>More entries were added to the texture packs.</li><li>More sounds were added.</li><li>Updated various textures.</li><li>Added ferrosite item and drop.</li><li>Re-added credits menu.</li><li>Now, by beating the Air Wizard, it will stop spawning hostile mobs in the sky.</li><li>A second layer of height is added to the rock mountains.</li></ul><h2>Changes</h2><ul><li>To avoid issues with the Ferrosite system, the xSpeed potion now no longer increases speed to 3.</li><li>Ferrosite speed was rewritten, now it works more fluid.</li><li>Particle animations have been improved.</li><li>Villages no longer spawn in the middle of the oceans.</li><li>Optimized mob spawn (does not affect spawners).</li><li>Now the player will have a small chance of taking more damage from the zombies.</li><li>Now when breaking cloud, there is a random probability that below that tile appears Ferrosite or Infinite fall tile.</li><li>Now the debug screen shows the &quot;Music factor&quot;, it shows a count that measures how long until the next music track is played in the game.</li><li>The memory consumption of the game was reduced a little (But there may be lag in big worlds).</li><li>Now the stairs play a sound when going down or going up</li></ul><h2>Bug Fixes</h2><ul><li>Fixed &quot;definitively&quot; the bug that did not reset the player\\'s speed when changing world ._.</li><li>Fixed a bug that allowed hunger while in Peaceful</li><li>An issue regarding the wool ID has been solved</li><li>Fixed a bug that caused that when putting Cloud on the surface it would generate a null tile</li><li><a href=\"https://github.com/MinicraftPlus/minicraft-plus-revived/pull/229\" target=\"_blank\" rel=\"noopener noreferrer\">MinicraftPlus/minicraft-plus-revived#229</a>Fixed a bug that incorrectly displayed the stairs sprite on the cloud tile</li><li><a href=\"https://github.com/MinicraftPlus/minicraft-plus-revived/pull/227\" target=\"_blank\" rel=\"noopener noreferrer\">MinicraftPlus/minicraft-plus-revived#227</a>Fixed issue where entity despawned in player\\'s sight</li><li>Fixed a bug in the world generator that incorrectly generated some structures in caves</li></ul>"},{"id":"aircraft_b0.4_1","title":"Aircraft Beta 0.4 Pre-release","body":"<p>This is a pre release, because it is difficult to maintain something very big :)</p><p>NOTICE: Loading old worlds in this version could corrupt your world (this due to the great change of IDS in the tiles), I recommend making a new one. As for code, seeing that Minicraft Plus has been changing too many things, Aircraft for the moment will stop updating the base code, this due to the difficulty and time it takes to update it. Also, the tutorial section is not ready, the missing or half-finished features will be ready in part 2, or if it is not possible, they will be finally released in the next update</p><h2>Added</h2><ul><li>Potato crops added.</li><li>Sky Wart crops were added (it only grows in the sky, it is essential for making potions).</li><li>Holy rock was added.</li><li>Added Phygs (Variants of pigs in the Aether .. but now they fly), They still don't really fly (A.I is very basic for now)</li><li>Added Sheepuffs (they are like floating fluffy sheep ... or so it looks like xd)</li><li>Now animals attracted to food emit particles of hearts.</li><li>Now the flashlights emit glitter particles.</li><li>When stepping on Ferrosite, it emits dust particles.</li><li>When stepping on Cloud, it emits mini-clouds particles.</li><li>When stepping on ferrosite, your speed increases.</li><li>Added Sky grass, Sky high grass and Ferrosite tiles.</li><li>Sky fern was added, watch out, if you walk on it, you will be slowly eaten</li><li>Saplings variants have been added for the other types of trees.</li><li>Added a new texture pack system (with 2 built-in packs)</li><li>Tutorial option added (for newbie users ._.)</li><li>The hotbar was changed and improved</li><li>Added Herobrine.</li></ul><h2>Changes</h2><ul><li>The world generator now generates the biomes more smoothly.</li><li>The generation of the surface and the sky was modified to try to reduce a lot of work in the game when generating the world (I hope it works)</li><li>The crops system has been updated so that they are easy to program, in addition to being more optimized.</li><li>The player now has a small chance of falling out of the sky if he steps too far on the edge of the cloud.</li><li>Wall tiles, tile doors and tile floors can be connected to the tiles around them (for now this only happens in the Aether dimension).</li><li>Now in the options menu you can continue watching the game.</li><li>Now the title menu has an image (it doesn't move for now :|).</li><li>Now you can plant Brich trees, Spruce trees and Pine trees.</li><li>Now the potions need Sky Wart to make the improved versions.</li><li>Updated all textures (even Legacy ones) :)</li><li>Added and updated most of the Dyes</li><li>Some recipes were changed</li><li>Villages spawn improved (now they are less likely to spawn in the middle of the water)</li><li>Crops were added to villages</li><li>The multiplayer has unfortunately been deactivated, due to the fact that the Minciraft plus login server is no longer available.</li><li>Now the Debug screen shows the count of used, available and free ram memory in real time</li><li>Now the random music system will run every 6 or 8 minutes, Random.nextInt() will no longer be used due to the problems it caused</li><li>Improved the Sparks' animation in the first phase of the AirWizard (it also causes more damage)</li><li>The accuracy of the Crash screens has been improved</li><li>The particle system has been improved, now it supports 4 frame animations</li><li>Much of the code was optimized</li></ul><h2>Bug Fixes</h2><ul><li>A crash is fixed when opening a server from the console caused by the failed loading of the other phases of the AirWizard.</li><li>Fixed a multiplayer crash caused by the random music system (I will check in the future to avoid more bugs like this).</li><li>Fixed a bug in multiplayer produced by EyeQueen .. killing it would have to play a sound and show the GUI .. but it only froze the server.</li><li>Fixed a bug that caused the maps to render badly.</li><li>Fixed a visual bug where on the Obsidian wall tile the sprite connector looked bad (I re-edited the texture).</li><li>Fixed a bug that made the \\&quot;walk speed\\&quot; not reset when changing the world</li><li>Fixed a bug that rendered the animation of the Giant bosses badly</li><li>Fixed a bug that did not change the texture of the AirWizard II correctly</li></ul>"},{"id":"aircraft_b0.3","title":"Aircraft Beta 0.3","body":"<h2>Added</h2><ul><li>Added support for Texture Packs (multi-textures)</li><li>Added &quot;Minicraft Legacy textures&quot; texture pack, an old school Minicraft-style texture pack.</li><li>A template was added for those who want to make textures</li><li>Added in-game background music</li><li>Goats were added (you get leather, and they spawn in the tundra biome, if it leaves that biome it will turn into a sheep)</li><li>Added &quot;Natural Rock&quot; (you can regenerate Stone in creative)</li><li>Golems now appear in villages</li><li>Villagers now appear in villages</li><li>Now the cleric has more trades (they change every month)</li><li>Now the Air Wizard will release the Alazif when he dies, (necessary to summon the Eye Queen)</li><li>Now the Giant bosses have animations</li><li>Now you can get sand from silicon, silicon is obtained using the Stone Cutter</li><li>Now the player\\'s illumination radius can be increased if you have a torch in hand</li><li>Fireballs were added</li><li>New skins added</li><li>Some sounds were added</li><li>Translations have been updated</li><li>Some textures were updated (among them, the logo)</li><li>Some sounds were updated</li><li>Visual presence in multiplayer has been optimized (this is experimental, not if it works correctly)</li><li>Optimized the Sparks of the Air Wizard</li><li>Updated the Debug GUI, now it shows the java architecture, and the World Seed</li><li>Added Herobrine</li></ul><h2>Bug Fixes</h2><ul><li>Fixed a bug that prevented Villagers spawn</li><li>Fixed a bug that prevented trading with villagers in multiplayer</li><li>Fixed an issue with Giant bosses animations (Keeper, EyeQueen)</li><li>Fixed an issue on MacOS, apparently creating a folder named Cthulhucraft, instead of Aircraft</li></ul>"},{"id":"aircraft_b0.2","title":"Aircraft Beta 0.2","body":"<p>Added support for 2.0.7, old worlds are still supported!</p><h2>Additions</h2><ul><li>Added one more melody when starting the game.</li><li>Scissors were added (you can cut the sheep's wool).</li><li>Clergy exchange tables have been changed.</li><li>Added Herobrine</li><li>Peaceful difficulty added</li></ul><h2>Changes</h2><ul><li>Now the AirWizard will not attack you if you are in creative mode.</li><li>Torches can now flash (this will be added to flashlights soon).</li><li>If you are in debugging and you are in creative mode you can delete stairs.</li><li>Due to security problems in multiplayer, the option to edit the world will be disabled when a server is created, if you are an administrator, you can change the game mode from the console.</li><li>Bosses can attack you even if you are on that difficulty.</li><li>The mob generators will not work.</li><li>You can take damage from cacti.</li><li>You can take damage when you hit a cactus.</li><li>Can take damage from tnt.</li><li>You can take damage from lava.</li><li>Hostile mobs will not attack you.</li><li>Creepers will not explode.</li><li>Mobs cannot appear, but if you change the difficulty while there are mobs, they will not be able to disappear, at least for a while.</li></ul><h2>Bug Fixes</h2><ul><li>Fixed an issue with the pickup item.</li><li>Fixed a serious problem with the boats (All the boats of the level change the sprite if the player moves in boat).</li><li>Fixed various issues with sounds (some are oversaturated in multiplayer, not playing, or the game crashes due to a code error)</li></ul>"},{"id":"aircraft_b0.1","title":"Aircraft Beta 0.1","body":"<p>This is a restructured version of Aircraft, some features may be missing, so it will be updated.</p><h2>Additions</h2><ul><li>The resolution and size of the window has been improved.</li><li>The Eye queen was reimplemented.</li><li>The Eye amulet, Icicle, and more items were reimplemented.</li><li>The generation of the terrain was optimized.</li><li>Trees were added to the sky.</li><li>Added phases to the Eye queen (for now it does not have unique attacks).</li><li>Various easter eggs and skins were added for different events.</li><li>Added utility to Keeper (by killing multiple slimes, I was able to appear).</li><li>Added a slight fix to Air wizard attacks.</li><li>Added an animation to the big bosses.</li><li>Added different phases when using a boat.</li><li>Added a new function (when creating a new world the game saves the seed).</li><li>Durability added to tools and adjusted to balance play.</li><li>Added Herobrine.</li></ul><h2>Debug</h2><ul><li>A timer was added to the F3 screen.</li><li>Added a test version counter.</li><li>Now the F3 screen shows the java version installed.</li></ul><h2>Bug Fixes</h2><ul><li>Fixed a terrain spawn bug (no flowers spawning).</li><li>Fixed a bug in multiplayer (game freezes when you have 2 hearts).</li><li>Fixed file handler bug on Linux (game clears folder on exit).</li><li>Fixed a bug regarding the controls.</li><li>A problem with the sound engine was solved</li></ul>"},{"id":"aircraft_a1.3","title":"Aircraft Alpha 1.3","body":""},{"id":"aircraft_a1.2.5_t","title":"Aircraft Alpha 1.2.5 Test","body":""},{"id":"aircraft_a1.2.5","title":"Aircraft Alpha 1.2.5","body":""},{"id":"aircraft_a1.2.4","title":"Aircraft Alpha 1.2.4","body":""},{"id":"aircraft_a1.2.3","title":"Aircraft Alpha 1.2.3","body":"<p>Music Update!!</p><h2>Additions</h2><ul><li>Music discs added</li><li>New &quot;Eye&quot; Mobs added</li><li>Potions expanded in &quot;Brewery&quot;</li><li>New biome &quot;Snow&quot;</li></ul><h2>Changes</h2><ul><li>Changed annoying sound from main menu</li><li>Now the trees drop leaves, essential to make paper</li></ul>"},{"id":"aircraft_a1.2.2","title":"Aircraft Alpha 1.2.2","body":""},{"id":"cthulhucraft_0.05a","title":"Cthulhucraft Beta 0.05a","body":"<p>Airwizard and stuff Update!!</p><p>The best thing about the whole update was (Added a menu where you can modify your world and change the game mode)</p><h2>Added</h2><ul><li>New phases and attacks have been added to Airwizard.</li><li>Various textures were improved.</li><li>A random sound reproduction system was implemented both on the surface and in caves (not yet finished).</li><li>The texture of the mycelium was changed.</li><li>The texture of the ores changed.</li><li>The villages were eliminated to be re-implemented, now they are better and connect with paths.</li><li>Added more variety of stones, and also statues (they still have no functions).</li><li>The color palette of the maps have been updated.</li><li>Changed the player's marker on the map :,).</li><li>The fps limit was extended internally (this was for testing, maybe it will be removed in the next version).</li><li>The F3 screen expanded.</li></ul><h2>Changes</h2><ul><li>Old entries were removed in the game settings.</li><li>Now when walking on snow you will hear the footsteps</li><li>villagers can now appear more easily</li><li>unnecessary crafting was moved or removed</li><li>water color corrected</li><li>there is more variety of sound when picking up an item</li><li>the noise scale was changed in the generation of worlds</li><li>now the grass can spread over the fungal infection</li></ul><h2>Bug Fixes</h2><ul><li>Fixed bug that made the mushroom infection bigger</li><li>Fixed a bug with the update notifier</li></ul>"},{"id":"cthulhucraft_0.05_3a","title":"Cthulhucraft Beta 0.05a Pre-Release 3","body":"<h2>Added</h2><ul><li>Added option to &quot;open game folder&quot; in option menu.</li><li>new phases have been added to the air mage, without modifying his health .. (for now there are no new attacks).</li><li>Added a new phase to the Deep Guardian</li><li>Enhanced potions were reimplemented.</li><li>The Brewery was reimplemented, now you can improve potions.</li><li>Assembler and stonecutter added.</li><li>Springs added.</li><li>Ice was added</li><li>Chickens dropping eggs added.</li><li>The Zombie king was added.</li><li>Necronomicon added (for now unused).</li><li>New types of wood were added... &quot;Spruce and Birch&quot; and its variations in walls, floors and doors.</li><li>New splashes have been added to the main menu.</li><li>Wool coloring dyes added (For now there are no recipes).</li></ul><h2>Changes</h2><ul><li>Items now have more durability.</li><li>Now the Deep Guardian I couldn\\'t swim.</li><li>Added a new phase to the Deep Guardian.</li><li>Maps changed to be more accurate.</li></ul><p>In order not to make this too long, I will not put the bugs solved since there are many, and most of them were taken out of extreme and multiplayer mode.</p>"},{"id":"cthulhucraft_0.05_2a","title":"Cthulhucraft Beta 0.05a Pre-Release 2","body":"<h2>Added</h2><ul><li>The generation of Mooshrooms was reactivated</li><li>Flower and mushroom sprites have been improved</li><li>Tree sprites have been improved (you can see the leaves)</li><li>Bowls, mushroom soup and carrot soup were added</li><li>The essences, strange liquids and powerful bottled were added (for now they have no use, it is being implemented for the next version)</li><li>Emeralds can now appear in village chests</li><li>The multiplayer fps rate has been improved, in addition to fixing a small problem with passive mobs (Passive mobs are extremely slow in multiplayer fixed!)</li><li>Fixed a little problem with the Boat recipe</li><li>Fixed a strange crash when trying to create 2 servers at the same time in the same world</li></ul>"},{"id":"cthulhucraft_0.05_1a","title":"Cthulhucraft Beta 0.05a Pre-Release 1","body":"<p>Pre-release!! Maps update</p><h2>Added</h2><ul><li>Added a new biome &quot;Mushroom Infection&quot;</li><li>Added Mooshrooms &quot;mushroom cows&quot;</li><li>Color Maps added (thanks A.L.I.C.E XD)</li><li>Added Spears &quot;weapons with random critical attacks&quot;</li><li>Trees were added to the sky</li><li>utility was added to the flints</li><li>The &quot;credits&quot; option was re-added in the main menu (please read them)</li></ul><h2>Changes</h2><ul><li>now wool burns if it is near lava</li><li>Boats can now be found in chests in villages and can be crafted</li><li>Fixed minor entity issues in multiplayer</li></ul>"},{"id":"cthulhucraft_0.04a","title":"Cthulhucraft Beta 0.04a","body":"<p>Solution to rendering problems</p>"},{"id":"cthulhucraft_0.03a","title":"Cthulhucraft Beta 0.03a","body":"<p>Updated main menu!</p>"},{"id":"cthulhucraft_0.02a","title":"Cthulhucraft Beta 0.02a","body":"<p>First Beta!!</p><h2>Added</h2><ul><li>Added 2 new bosses... &quot;The Guardian of the Deep&quot;, &quot;Cthulhu&quot;.</li><li>Enchantment books added... enchanted armor and weapons</li><li>Villagers re-added and Villages added</li><li>Added Golems and Old Golems (Bad Golems)</li><li>More shades of wool were added ... more vegetation (grass, flowers) ... more trees and biomes (birch, fir, snowy pine ... snow biome).</li><li>Added Guimans (Penguin Men that appear in the snowy biome)</li><li>Boats added to navigate</li><li>Carrot Crop was added</li><li>Castles were added to heaven</li><li>Sprites, graphics and items were notably improved</li><li>Warning: many Features are still missing due to a big change in Minicraft+ versions ... as the versions progress they will be added again</li></ul>"},{"id":"microcraft_1.0","title":"Microcraft 1.0","body":"<p>A Minicraft remake with some neat extras. Beat the fearsome AIR WIZARD to win the game!</p><h2>Extra Features</h2><ul><li>Mithril (new material)</li><li>Iron/Gold/Mithril armor</li><li>Fancy lighting system</li><li>Skeleton archers</li><li>Blue and red slimes</li><li>Cool new air wizard powers</li><li>Character customization</li><li>and much more...</li></ul>"},{"id":"miniventure_a2.2","title":"Miniventure 2.2 Alpha","body":"<p>Another update after ages! This addresses memory problems that have been present for a while; the game should be runnable with a lot less available memory now. Future updates should finally start focusing on content, so look forward to that!</p><h2>Changes</h2><ul><li>Fixed some bugs with inventory selection</li><li>Backend changes to menus</li><li>CPU optimizations for packet reading</li><li>Only unlocked islands now show in map screen</li><li>Unloaded level data is no longer cached in memory</li><li>Various other optimizations to reduce memory usage; if you run from the command line with -Xmx, you can do -Xmx300M with very little performance impact; I've yet to figure out a way to specify this limit without requiring the user to do it themselves</li></ul>"},{"id":"miniventure_a2.1","title":"Miniventure 2.1 Alpha","body":"<p>It's finally here! I took a number of months' break since the last release, but this last month I've been working on it again, and this is the result of that work. See change log as always, but there's some new sprites, better world version management, and hopefully improved selection capabilities (though I may change it again later), as well a new crafitng mechanic.</p><h2>Changes</h2><ul><li>Moved game data directory for Windows users to Documents/My Games/Miniventure</li><li>Completely remade crafting system; craftables now come in two types: items, and objects. Objects are created in the world itself, instead of going into your inventory. Items go into your inventory as usual.</li><li>Added better interaction with world list; compatibility issues and possible solutions will be displayed for older versions, as well as a notice when changes occur to the save format.</li><li>Cursor-based interaction is more obvious by highlighting the tile that will be interacted with</li><li>When constructing objects, and with placeable items, there is a range of a few tiles away that you can interact, instead of it always being next to the player. This is blocked by solid tiles however.</li><li> Changed the player sprite</li></ul>"},{"id":"miniventure_a1.2","title":"Miniventure 1.2 Alpha","body":"<p>This release brings mainly an overhauled inventory screen, that's hopefully much easier to use than the previous version. There are also some input changes for wasd and such. Let me know what you think!</p><h2>Changes</h2><ul><li>Brand new inventory screen that is hopefully much more ergonomic than the previous screen (crafting screen overhaul coming soon)</li><li>Fixed a number of ui and item bugs</li><li>Improved input controls to allow for wasd movement and mouse interaction</li><li>Made saved world list sort by modification time, so recently played worlds appear highest</li></ul>"},{"id":"miniventure_a1.1","title":"Miniventure 1.1 Alpha","body":"<p>Well here goes nothing! Here's the first version of miniventure alpha. Everything before was Pre-alpha. You'll notice that there's now a save system, and that the map is composed of islands. Hope you like what's here so far!</p><h2>Changes</h2><ul><li>Brand new terrain system consisting of islands (well, only one island right now)</li><li>Save system implemented</li></ul>"},{"id":"miniventure_pa-1.5","title":"Miniventure 1.5 Pre-Alpha","body":"<p>1.5 Official is finally here! The number of iterations that the ui system went through is ridiculous, as is the span of time it's been since 1.4. But it's finally done! Check the change log to see all the details of all the things that have happened since 1.4. There are quite a number of significant changes.</p><p>Also this is the last version that will use the 'effectively infinite' terrain generation pattern; 1.6 will be all about separating stuff into islands, as well as a save system! Because that's long overdue. But it would have been pointless to create a special save system with the inf terrain when I planned to replace it. I didn't plan to originally of course, but there were other reasons I didn't have a save system at the time.</p><p>Anyway, enjoy the build! I've tried to fix as many bugs as possible since this is an official version, but you know how it goes... I don't have an army of 100 testers to catch everything. :P</p>"},{"id":"miniventure_pa-1.5-pre7","title":"Miniventure 1.5 Pre-Alpha Pre-Release 7","body":"<p>Did a whole bunch in this update! This is almost going to be the same as 1.5 official, just maybe a couple more bug fixes will be in that one. 1.5 is going to be the last update before the big level gen overhaul, and then the save system, so it's sort of like the end of this stage of the game. I've considered 2.0 but that seems too extravagant. I want 2.0 to be what 1.0 was supposed to be; the final game, in initial form. Stuff after that will be like extras. The storyline will be implemented by then.</p><p>Anyway! Back to this update. Lots of bug fixes, some edits to player stats, some ui edits and fixes, a clear command for chat; it's all over the place. See change log. Enjoy!</p><h2>Changes</h2><ul><li>Fixed a whole bunch of bugs in a whole bunch of areas</li><li>Updated interaction bounds</li><li>Decreased stamina</li><li>Decreased hurt cooldown</li><li>Made all prompt menus screens instead of popups</li><li>Decreased chat message display time</li><li>Made Chat screen scroll to display more messages</li><li>Made items in your inventory but not hotbar stay out of your hotbar if you pickup another item of the same type</li><li>Added command to clear chat</li></ul>"},{"id":"miniventure_pa-1.5-pre6","title":"Miniventure 1.5 Pre-Alpha Pre-Release 6","body":"<p>The crafting screen is back! Only much better. Many sprites also got an update, and there were a few other changes as well</p><h2>Changes</h2><ul><li>Added crafting screen</li><li>Added recipes for all tool variants</li><li>Forced player to view instructions</li><li>Fixed ores to actually appear in the map (soon to be obsolete in 1.6/1.7)</li><li>Removed excessive stamina drain from tools</li><li>Improved a number of tile and item sprites</li></ul>"},{"id":"miniventure_pa-1.5-pre5","title":"Miniventure 1.5 Pre-Alpha Pre-Release 5","body":"<p>Inventory screen is looking pretty cool in this one! Crafting screen isn't here yet, but it's been so long that I just wanted to get this out. 1.5 pre-release 6 will come wmuch quicker, with the crafting screen, and then it'll be on to 1.6. Enjoy!</p><h2>Changes</h2><ul><li>Added/fixed/finalized inventory screen</li><li>Removed crafting screen temporarily</li></ul>"},{"id":"miniventure_pa-1.5-pre4","title":"Miniventure 1.5 Pre-Alpha Pre-Release 4","body":"<p>Level generation update! Now worlds are make of islands that have different themes. More improvements coming soon!</p><h2>Changes</h2><ul><li>Changed level generation drastically</li></ul>"},{"id":"miniventure_pa-1.5-pre3","title":"Miniventure 1.5 Pre-Alpha Pre-Release 3","body":"<p>Sorry about the last version! But this one fixes just about all of the issues with the previous one. And adds a couple new things.</p><h2>Changes</h2><ul><li>Fixed all the bugs in pre-release 2</li><li>Made apple and log sprites smaller</li><li>Gave some tiles a &quot;3D&quot; effect, where you can go in front and behind them, partially</li></ul>"},{"id":"miniventure_pa-1.5-pre2","title":"Miniventure 1.5 Pre-Alpha Pre-Release 2","body":"<p>I finished the tilesystem overhaul! But since you can't really see that, I also implemented swimming sprites, and you can sort of walk in front and behind some tiles/entities. Enjoy!</p><h2>Changes</h2><ul><li>Major Tilesystem overhaul, though you won't notice unless you look at the code. It makes it easier to have multiple variations of a tile</li><li>Added animation for being in water</li></ul>"},{"id":"miniventure_pa-1.5-pre1","title":"Miniventure 1.5 Pre-Alpha Pre-Release 1","body":"<p>I played with level gen a lot here; biomes are a lot bigger, and most stone has paths through it. I also added more tree types. And an auto-updater! So you know when the next version is available.</p><h2>Changes</h2><ul><li>Added update checker</li><li>Fixed a bunch of bugs</li><li>Added pig sprites</li></ul>"},{"id":"miniventure_pa-1.4","title":"Miniventure 1.4 Pre-Alpha","body":"<p>Alright, it's finally (more or less) ready! This release comes with a number of things... I think the biggest is the new inventory system! Oh, also, mobs can hurt you, but only the ones that follow you, and those spawn at night (though there are some who will begin to attack you if you hit them... ;). Also sound effects, and some music! That's most of it. Hope I could fix most of the bugs!</p>"},{"id":"miniventure_pa-1.4-pre7","title":"Miniventure 1.4 Pre-Alpha Pre-Release 7","body":"<p>This update fixes crafting (a bit broken in the previous release), and server crash when zooming out. It also adds the ability to drop items from your inventory and hotbar, and the relavant instructions for all of this. Enjoy!</p>"},{"id":"miniventure_pa-1.4-pre6","title":"Miniventure 1.4 Pre-Alpha Pre-Release 6","body":"<p>Inventory update! Added a hotbar, and removed item stacks. You'll notice that the hotbar still displays an item count, and it may seem a little odd. It's supposed to show how many total items you have, if any of that item is in the inventory, but I was having a lot of trouble deciding what to do if there were multiple in the hotbar at the same time. I decided to just have them both display the total, including themselves. Please, give me feedback on how to improve this system, and the item selection system.</p>"},{"id":"miniventure_pa-1.4-pre5","title":"Miniventure 1.4 Pre-Alpha Pre-Release 5","body":"<p>I've made a number of further improvements to the crafting and inventory menus.</p>"},{"id":"miniventure_pa-1.4-pre4","title":"Miniventure 1.4 Pre-Alpha Pre-Release 4","body":"<p>This is sorta experimental; I'm considering big changes to the inventory, crafting, and general item systems.</p>"},{"id":"miniventure_pa-1.4-pre3","title":"Miniventure 1.4 Pre-Alpha Pre-Release 3","body":"<p>So this update is mostly sounds; that's what this one is all about. I added a bunch of sound effects for various things. I was going to add a walking sound effect, but I couldn't find a good one so I didn't. Anyways, enjoy!</p>"},{"id":"miniventure_pa-1.4-pre2","title":"Miniventure 1.4 Pre-Alpha Pre-Release 2","body":"<p>I've added music! Also fixed a chat bug that I may have put in 1.4 pre-release 1. Enjoy!</p>"},{"id":"miniventure_pa-1.4-pre1","title":"Miniventure 1.4 Pre-Alpha Pre-Release 1","body":"<p>1.4 pre-release 1! I don't really feel like listing off everything I changed since 1.3, because it was a lot of misc things, but some important ones are the beginnings of tab autocompletion for commands, and a revamped title screen. Along with better server closing management. If you want to know everything, check the commit logs. Enjoy!</p>"},{"id":"miniventure_pa-1.3","title":"Miniventure 1.3 Pre-Alpha","body":"<p>Alright, here's the official release! Miniventure 1.3, the multiplayer update! Not much to say, really, other than enjoy. :3</p>"},{"id":"miniventure_pa-1.3-pre9","title":"Miniventure 1.3 Pre-Alpha Pre-Release 9","body":"<p>Alright, this is a good one! The chat system actually looks quite good now. In fact, I'm rather proud of it. Along with some misc bug fixes, that's most of the news. Oh, and the player will now start to take damage when the hunger bar drops to zero.</p>"},{"id":"miniventure_pa-1.3-pre8","title":"Miniventure 1.3 Pre-Alpha Pre-Release 8","body":"<p>With this comes a much better chat system, more commands, a few new sprites, and time-of-day sync (bug fix). Enjoy!</p>"},{"id":"miniventure_pa-1.3-pre7","title":"Miniventure 1.3 Pre-Alpha Pre-Release 7","body":"<p>I fixed a number of bugs in this release, namely doors, respawning, and water flowing. I also made grass not get dropped anymore, and grass will also slowly spread to adjacent dirt tiles. Enjoy!</p>"},{"id":"miniventure_pa-1.3-pre6","title":"Miniventure 1.3 Pre-Alpha Pre-Release 6","body":"<p>Alright guys, next release! This one has... drumroll... commands! No many, mind you, but the system has been put in place. Certain commands are only accessable if you are on the same computer as the server, or are using the server command prompt itself. So, random people cannot just stop the server, lol. Anyway, enjoy!</p>"},{"id":"miniventure_pa-1.3-pre5","title":"Miniventure 1.3 Pre-Alpha Pre-Release 5","body":"<p>Wow... Well I did not expect to get this far this fast, but I have managed to implement a VERY simple and not very good looking, but apparently functional chat system. Here you go!</p>"},{"id":"miniventure_pa-1.3-pre4","title":"Miniventure 1.3 Pre-Alpha Pre-Release 4","body":"<p>So I have fixed a lot of bugs in general in this release; and I mean a lot of bugs. There is one bug that makes the player jump back a bit whenever you walk into a mob that is walking towards you, but that will hopefully be fixed in the next release. One last thing, I updated some of the sprites, such as MobAis so you can tell who is a player, until I have actual mob sprites... anyway, enjoy, and report bugs!</p>"},{"id":"miniventure_pa-1.3-pre3","title":"Miniventure 1.3 Pre-Alpha Pre-Release 3","body":"<h2>Changes</h2><ul><li>Added an error screen</li><li>Fixed things relating to running the server from startup, with no GUI</li></ul>"},{"id":"miniventure_pa-1.3-pre2","title":"Miniventure 1.3 Pre-Alpha Pre-Release 2","body":"<p>Alright guys! This is what you have all been waiting for! Multiplayer is now functional! I cannot guarantee it is without bugs, but I have tried my best. Tell me what you think! This is still very basic in terms of functionality, there will be more soon, such as chat. But this is the start!</p>"},{"id":"miniventure_pa-1.3-pre1","title":"Miniventure 1.3 Pre-Alpha Pre-Release 1","body":"<p>Alright, so this release seems to break a lot of features... And it does, sort of. But it is only temporary. This release starts a server locally, and connects you to it. It then loads the first few chunks, which you can walk around in. That is all it does. No entities, and things do not update. However, this took a lot of effort to make so far, and I think it represents a really important milestone; also, I am going to remake the entity system after this release, so it all just seemed to fit. You are better off with 1.2 for now.</p>"},{"id":"miniventure_pa-1.2","title":"Miniventure 1.2 Pre-Alpha","body":"<p>This version includes infinite terrain! Additionaly, there are a lot of cool new animations, a few new tiles and objects, and a functional hunger, stamina, and health regen system. Next up, multiplayer!</p>"},{"id":"miniventure_pa-1.2-pre6","title":"Miniventure 1.2 Pre-Alpha Pre-Release 6","body":"<p>Alright, I fleshed out the stamina, health, and hunger systems! Enjoy.</p>"},{"id":"miniventure_pa-1.2-pre5","title":"Miniventure 1.2 Pre-Alpha Pre-Release 5","body":"<p>Alright, I fixed a few bugs relating to moving entities off tiles they are not supposed to be on. I also added doors, with open/close animations! And changed the water edge animations! Oh, and I decreased the stamina usage of wood tools, because it was too high. Enjoy!</p>"},{"id":"miniventure_pa-1.2-pre4","title":"Miniventure 1.2 Pre-Alpha Pre-Release 4","body":"<p>So I made a bunch of cool updates this time, such as stamina and holding down a button for repeated input. Enjoy!</p>"},{"id":"miniventure_pa-1.2-pre3","title":"Miniventure 1.2 Pre-Alpha Pre-Release 3","body":"<p>Implemented a system for tile transitions! Currently, the only use is with torches; their flame will now give a little &quot;bounce&quot; upon being initially placed down. This system is super exciting, though, because there is actually so much that could be done with it. Think about placing down a tree seed. It could be animated to sprout into a sapling, there. Doors can now also be animated. The possibilies are huge!</p><p>Oh, I also made wood tools break after 30 hits rather than 20.</p>"},{"id":"miniventure_pa-1.2-pre2","title":"Miniventure 1.2 Pre-Alpha Pre-Release 2","body":"<p>Added some animated particles for when you attack, and on attacked tiles.</p>"},{"id":"miniventure_pa-1.2-pre1","title":"Miniventure 1.2 Pre-Alpha Pre-Release 1","body":"<p>Infinite level gen! Well, infinite enough. enjoy! P.S. you can press the B key to show chunk boundries.</p>"},{"id":"miniventure_pa-1.1","title":"Miniventure 1.1 Pre-Alpha","body":"<p>Daylight cycle, some bug fixes, UI/crafting system, mob AIs.</p>"},{"id":"miniventure_pa-1.1-pre7","title":"Miniventure 1.1 Pre-Alpha Pre-Release 7","body":"<p>I improved the daylight cycle a ton, it (hopefully) looks a lot nicer now.</p>"},{"id":"miniventure_pa-1.1-pre6","title":"Miniventure 1.1 Pre-Alpha Pre-Release 6","body":"<p>Alright, so I fixed a bunch of little bugs (item drops, mob AIs, UI resizing), and I improved the daylight cycle a little bit. This could end up being more or less the same as the official release, I just want to put this out beforehand just to check for bugs before I make it official.</p>"},{"id":"miniventure_pa-1.1-pre5","title":"Miniventure 1.1 Pre-Alpha Pre-Release 5","body":"<p>Added a day / night cycle. one full cycle lasts 5 minutes. I also added torches which provide light, and are animated due to another awesome person.</p>"},{"id":"miniventure_pa-1.1-pre4","title":"Miniventure 1.1 Pre-Alpha Pre-Release 4","body":"<p>Ive fixed log drops, and added some more tools. Also the tile system is implemented a bit different, though it doesnt affect the gameplay. Enjoy!</p>"},{"id":"miniventure_pa-1.1-pre3","title":"Miniventure 1.1 Pre-Alpha Pre-Release 3","body":"<p>Added mobAis! They all have the same skin, but they do a couple different things. Try hitting them. :P</p>"},{"id":"miniventure_pa-1.1-pre2","title":"Miniventure 1.1 Pre-Alpha Pre-Release 2","body":"<p>Added a crafting menu! It doesnt look pretty, and the sprite for a wood pickaxe is actually a gem sword... but Im a little short on sprites, so, thats just how its going to be for now I guess...</p>"},{"id":"miniventure_pa-1.1-pre1","title":"Miniventure 1.1 Pre-Alpha Pre-Release 1","body":"<p>Here we have a rudimentary UI system, including the main menu, respawn screen, and inventory menu. Next up, crafting!</p>"},{"id":"miniventure_pa-1.0.1","title":"Miniventure 1.0.1 Pre-Alpha","body":"<p>I implemented world gen, and so I thought this was a good place to stop and release a version. Note, you can scroll the game &quot;zoom&quot; with the plus and minus keys</p>"},{"id":"miniventure_pa-1.0","title":"Miniventure 1.0 Pre-Alpha","body":"<p>Here's the first official release! I'm going to be working on a UI next, so I figured this is a good place to stop. The game, as of this release, randomly generates a world out of a couple different tiles. You can interact with tiles, pickup the items they drop, and set the items down as well. You can also get hurt, die, and respawn. As of now, there are no other mobs or levels, and you can't craft things. You also can't save. And there are no menus.</p>"},{"id":"miniventure_pa-1.0-pre8","title":"Miniventure 1.0 Pre-Alpha Pre-Release 8","body":"<p>This has a number of improvements, such as knockback, damage particles, respawning, and a loading screen.</p>"},{"id":"miniventure_pa-1.0-pre7","title":"Miniventure 1.0 Pre-Alpha Pre-Release 7","body":"<p>Tile items drop when you destory some tiles! And you can pick them up, they are added to your inventory (though you can only access the first item in your inv, that will be changed next time), and you can put the tiles back down where they go. Progress!</p>"},{"id":"miniventure_pa-1.0-pre6","title":"Miniventure 1.0 Pre-Alpha Pre-Release 6","body":"<p>item drops! Dont ask why dirt drops gem swords... thats the only item that exists right the moment...</p>"},{"id":"miniventure_pa-1.0-pre5","title":"Miniventure 1.0 Pre-Alpha Pre-Release 5","body":"<p>The water's edge is now animated!</p>"},{"id":"miniventure_pa-1.0-pre4","title":"Miniventure 1.0 Pre-Alpha Pre-Release 4","body":"<p>Added lots of tile rendering tweaks and implementations to make some tiles blend better -- added tile overlap system. Nailed the grass overlap sprite. Now I finally realize how amazing dithering is. :3</p>"},{"id":"miniventure_pa-1.0-pre3","title":"Miniventure 1.0 Pre-Alpha Pre-Release 3","body":"<p>I successfully implemented a system for tile connections! Works for trees and holes, as of now. Tile overlaps are in the works.</p>"},{"id":"miniventure_pa-1.0-pre2","title":"Miniventure 1.0 Pre-Alpha Pre-Release 2","body":"<p>added some tiles like cactus and updated other tile sprites, fixed level spawning, and made the camera function correctly when the window is resized. Water also flows into adjacent hole tiles.</p>"},{"id":"miniventure_pa-1.0-pre1","title":"Miniventure 1.0 Pre-Alpha Pre-Release 1","body":"<p>I got enough of a system to decide it was worth publishing. Player is animated, tiles shown, player can collide with and attack/destroy tiles.</p>"},{"id":"unitycraft_0.0.1","title":"Unitycraft 0.0.1","body":"<p>Initial Unitycraft release for playtesting</p>"}]}